{
  "id": "briareus-ex",
  "name": "Briareus EX",
  "category": "cannon",
  "atk": 394,
  "crt": 39,
  "rarity": 6,
  "originalWeapons": ["briareus-pri"],
  "sources": [
    {
      "type": "pri-weapon-foundry"
    }
  ],
  "skills": [
    {
      "name": "Gigantomachy",
      "description": "[SP: 0][CD: 30s] Creates a 6s spacetime field to deal 8x450.0% ATK of AOE Physical DMG, inflicting Time Slow and impairing enemies (DEF down by 65.0%) during the duration. The impairing debuff lasts another 4s after the field ends. During the weapon active, the wielder is invincible and character switching will not end the field channeling. This weapon active cannot be cast again by other wielder(s) for 30s since last activation."
    },
    {
      "name": "Hundred Hands",
      "description": "Performing certain attacks switches the weapon's attack mode. Every switch grants the wielder 1 stack of buff for 40s (10 stacks max; triggering it again resets the duration). Buff effect (1 stack): The wielder takes 3.00% less Total DMG, gains 2.00 Crit Rate and 2% Move Speed.\nHoR: Triggered by Charged ATKs; switch order: missiles, cannon, laser; each switch restores 2 SP.\nBlack Nucleus: Triggered by 3rd sequence Charged ATKs; switch order: Multiple Cluster Missiles, Multiple Cluster Missiles, and special laser; each switch restores 5.0 SP.\nHaxxor Bunny: Triggered by Charged ATKs; Switch order: missiles, cannon, laser; each switch restores 5.0 SP; each drone's Special ATK type follows the current weapon mode when it's summoned.\nOthers: Triggered by 3rd sequence Charged ATKs; switch order: Multiple Cluster Missiles, Autocannon, and special laser; each switch restores 5.0 SP."
    },
    {
      "name": "Fifty Heads",
      "description": "The wielder gains 25% ATK Speed. This weapon counts as cannon, missile, and rapid fire at the same time for weapon type buff calculation. Wielders of different types enjoy different bonuses: MECH - Total DMG +16.0%; BIO - Physical DMG +20.0%; PSY - ATK Speed +20.0%."
    }
  ],
  "version": "3.9"
}
