{
  "id": "seven-thunders-pri",
  "name": "Seven Thunders of Retribution - Naruikazuchimi",
  "category": "katana",
  "atk": 452,
  "crt": 11,
  "rarity": 6,
  "battlesuits": [{ "id": "hot" }],
  "originalWeapons": ["seven-thunders"],
  "sources": [
    {
      "type": "pri-weapon-foundry"
    }
  ],
  "skills": [
    {
      "name": "Naruikazuchinokami",
      "description": "(Test Server) [SP: 0][CD: 15s] Releases Honkai energy of the Divine Key, unleashes a cross slash and detonates with thunder and lightning. Deals 400.0% x 2 + 100.0 x 4 ATK of Lightning DMG, accumulates 10 Paralyze Trauma, gains invincibility and 10 SP during the active skill.\nHerrscher of Thunder equip bonus: The active skill can be used during the burst to deal 400.0% + 100% x 4 ATK of Lightning DMG. During the active skill, gains invincibility and triggers Ultimate Evasion skill. After using the active skill, Herrscher of Thunder can release Finisher immediately and CD of the Ult is increased by 11s. When the active skill hits an enemy twice, applies [Narukami] status to the enemy for 15s."
    },
    {
      "name": "Punishment of Sin",
      "description": "(Test Server) Increases Total DMG against enemies of countered types by 45.0%. CD of the active skill is refreshed when using Ult. This effect has 10s of CD.\nHerrscher of Thunder equip bonus: During Ult and Finisher, all skill timers and the stage timer are paused; Each entry restores 200 Herrscher energy. CD: 10;\nIf the active skill is used in the burst state, the dragon stays on the field as a summoned entity after releasing Finisher till the host exits, releases Bombard. When the dragon is on the field, the host stays in Herrscher Form. The dragon obtains energy equal to the host's current Herrscher Charge up to 600. Energy consumetion of Bombard becomes 200% and DMG dealt becomes 70% DMG of the host's DMG. When the energy is depleted, the dragon stays more than 10s, or the host use Ult again, the dragon exits."
    },
    {
      "name": "Upraised Dagger-axe",
      "description": "(Test Server) In non-burst mode, increases Lightning DMG by 35.0%.\nHerrscher of Thunder equip bonus: When energy of the dragon is depleted or the duration  reaches the miximum time, the dragon swoops towards enemies to deal 100.0% ATK of Lightning DMG. Every time the host unleashes Shinzan Strike, the swooping deals 300.0% ATK of bonus Lightning DMG, up to 2 x 300.0%."
    },
    {
      "name": "Key of Sanction",
      "description": "In co-op raids, increases Element DMG +25.0%."
    }
  ],
  "version": "5.8"
}
