{
  "id": "6s",
  "name": "Sixth Serenade",
  "type": "psychic",
  "valkyrie": "kallen",
  "strengths": ["ice dmg", "freeze"],
  "leader": {
    "core": {
      "name": "Phantom Curtain",
      "description": "Leader Bonus:\nPhantom Curtain: Team gains 24% Elemental DMG and takes 22% less Elemental DMG."
    },
    "subskills": [
      {
        "name": "Phantom Curtain",
        "description": "Team gains 32% All Elemental DMG and takes 26% less Elemental DMG.",
        "requiredRank": "ss"
      }
    ]
  },
  "special": {
    "core": {
      "name": "Combo: Gloomy Dawn",
      "description": "Consume Nachtsicht to perform a Combo ATK.\nTap [ATK] right after the 4-sequence basic attack to directly unleash a Combo ATK (does not consume Nachsicht), that deals 200% ATK of Physical DMG and inflicts a Raven Mark on the target.\nWith at least 300 Nachtsicht, tap [ATK] after a Combo ATK, or hold [ATK] after the first 3-sequences of the Basic ATK to consume 300 to unleash another Combo ATK.\nInitial Nachtsicht: 100; max: 600."
    },
    "subskills": [
      {
        "name": "Switch: Midnight Arrival",
        "description": "Switch entry directly unleashes a more powerful spinning kick, dealing 120% + 200% ATK of Physical DMG."
      },
      {
        "name": "QTE: Black Moon",
        "description": "QTE: triggered upon shield break: shuttles 2 times, each dealing 2x120% ATK of Physical DMG + 480.0% ATK of Ice DMG, and adds 1 Raven Mark to enemies hit. After QTE, tap the [ATK] button to directly perform a Combo ATK without consuming Nachtsicht."
      },
      {
        "name": "Repentance",
        "description": "2 Raven Mark stacks: increase brand consumption DMG to 400.0% ATK of Ice DMG.\n3 stacks: increase DMG to single target 600.0% + AOE 200.0% ATK of Ice DMG."
      }
    ]
  },
  "passive": {
    "core": {
      "name": "Passive",
      "description": "Raven Mark: special mark that can stack up to 3 times on the enemy.\nMarks can be stacked for the duration, or harvested from the enemy to deal the following effects:\n1 mark: after 5s, deal 100% ATK of Ice DMG.\n2 marks: after 5s, deal 200% ATK of Ice DMG and knock the enemy airborne.\n3 marks: applies Time Lock to the enemy and prevents them from dying within the period; after 2s, deal single target 200% + AOE 100% ATK of Ice DMG, and knocking enemies airborne and freezing them for 2s."
    },
    "subskills": [
      {
        "name": "Wither",
        "description": "For each kill, gain 300 Nachtsicht charges.",
        "requiredRank": "sss"
      },
      {
        "name": "Death by Dawn",
        "description": "Gain 50.0% Total DMG Multiplier for attacks by self against enemies with no shields."
      },
      {
        "name": "Nightwalker",
        "description": "Hitting an enemy with a Raven Mark recovers 5.0 SP. CD: 4.0s.",
        "requiredRank": "ss"
      }
    ]
  },
  "ultimate": {
    "core": {
      "name": "Night Carnival",
      "description": "Unleash the Raven Cross and assume Raven Form.\nDeals 100% ATK of Ice DMG to enemies in the AOE and adds an empowered 3-stack Raven Mark, which can then be harvested after 4s to deal Single 600% + AOE 200% of Ice DMG. Knock enemies airborne after the attack.\nCharacter performs a multi-hit Shuttle ATK that deals 12x60% ATK of Ice DMG and assumes Raven Form while the Raven Cross immobilizes enemies in a large AOE.\nRaven Form: character recovers 15 Nachtsicht every 0.1s. Duration: 12s.\nSP cost: 125"
    },
    "subskills": [
      {
        "name": "Overgrowth",
        "description": "In Raven Form, the Valkyrie gains 50.0% All Elemental DMG.",
        "requiredRank": "ss"
      },
      {
        "name": "Knell",
        "description": "In Raven Form, Basic ATKs additional deals 60.0% ATK of Ice DMG upon hit."
      },
      {
        "name": "Coronach",
        "description": "Each sequence of Shuttle Attack deals additionally 120.0% ATK of Ice DMG."
      }
    ]
  },
  "evasion": {
    "core": {
      "name": "Raven Blitz",
      "description": "Quickly evades enemy attacks. Can be performed twice in a row.\nUltimate Evasion recovers 100 Nachtsicht.\nRaven Blitz: Triggered upon an Ultimate Evasion, dealing 80% ATK of Ice DMG against nearby enemies and adds 1 stack of Raven Mark; tap [ATK] button to perform a Combo ATK (does not consume Nachtsicht); CD: 15s."
    },
    "subskills": [
      {
        "name": "Elegy",
        "description": "Raven Blitz additionally deals 120.0% ATK of Ice DMG, and additionally recovers 100 Nachtsicht for the Valkyrie."
      },
      {
        "name": "Sinner's Eye",
        "description": "Shortens Raven Blitz CD by 4.00s."
      }
    ]
  },
  "basic": {
    "core": {
      "name": "Twilight Nocturne",
      "description": "Unleashes 4-sequence Gun Kata attack.\n4-sequence Gun Kata attack:\n1st Sequence: 70% ATK of Physical DMG.\n2nd Sequence: 70% ATK of Physical DMG.\n3rd Sequence: (40% + 3x30% + 30% + 80%) ATK of Physical DMG.\n4th Sequence: 100% ATK of Physical DMG.\nThe 2nd, 3rd, and the 4th Sequences each recovers 40 Nachtsicht upon hit."
    },
    "subskills": [
      {
        "name": "Sound of Peace",
        "description": "When Combo ATKs hit an enemy, deal additional 3x120% ATK of Ice DMG."
      },
      {
        "name": "Rogue's Kiss",
        "description": "Applying Raven Marks on enemies also corrode them for 5.00s. Additional stacks of Raven Marks resets the duration of the corrosion. Character gains 40.0% Total DMG Multiplier for attacks against corroding enemies."
      },
      {
        "name": "Lamentations",
        "description": "After the 4-sequence Basic ATK hits a target with a Raven Mark, character gains Ignore Interrupt and 20.0% Total DMG Multiplier for 4.00s. Triggering this skill again resets the duration."
      }
    ]
  }
}
