{
  "id": "ae",
  "version": "3.7",
  "name": "Azure Empyrea",
  "type": "psychic",
  "valkyrie": "fuhua",
  "strengths": ["fire dmg", "time mastery", "gather", "ignite"],
  "leader": {
    "core": {
      "name": "Hex of Exposure",
      "description": "Leader Bonus:\nHex of Exposure: All team members gain 14% Total DMG for 15.0s after entry. If the team consists of members of 3 different types, all team members gain 22% Total DMG."
    },
    "subskills": [
      {
        "name": "Hex of Devastation",
        "description": "The first four Combo ATKs restore 1/2/4/8 SP for Azure Empyrea and deal 50% more Fire DMG. Casting Ultimate resets the counter.",
        "requiredRank": "ss"
      },
      {
        "name": "Hex of Exposure",
        "description": "All team members gain 18% Total DMG for 15.0s after entry. If the team consists of members of 3 different types, all team members gain 24% Total DMG.",
        "requiredRank": "s3"
      },
      {
        "name": "Hex of Gale",
        "description": "Azure Empyrea gains 10.0% Total DMG for 20.0%s when her Basic ATK, Combo ATK, weapon active or Ultimate lands. The effect stacks when triggered by different types of attacks; the effect duration resets when triggered by the same type of attack.",
        "requiredRank": "sss"
      }
    ]
  },
  "special": {
    "core": {
      "name": "Combo: Yin-Yang Tempo",
      "description": "When the sum of Yin and Tang reaches 3, hold [ATK] to unleash various Combo ATKs based on the numbers of Yin and Yang.\n3 Yang: Unleashes Senpo: Emperyan Fir, dealing 900% ATK of Fire DMG and additionally restores 4 SP upon hit.\n2 Yin + 1 Yang/1 Yin + 2 Yang: Unleashes Senpo: Snaring Flame, dealing 600% ATK of Fire DMG and pulling in enemies and immobilizing them for 3s; if this combo hits any target, all Valkyries on the battlefield restore 1 SP per second for 15s.3 Yin: Unleashes Senpo: Magma Melt, dealing 600% ATK of Fire DMG and boosting the team's All Elemental DMG against the target hit by this combo by 30% for 15s."
    },
    "subskills": [
      {
        "name": "Hex of Crucibles",
        "description": "Combo ATK hit makes the target take 35.0% more Fire DMG for 15s."
      },
      {
        "name": "Hex of Drowning",
        "description": "Combo ATK hit makes the target take 30.0% more Ice DMG for 15s."
      },
      {
        "name": "Hex of Mending",
        "description": "Combo ATK hits heals all team members for 60 HP; CD 3s.",
        "requiredRank": "ss"
      }
    ]
  },
  "passive": {
    "core": {
      "name": "Passive",
      "description": "Passive bonuses apply automatically."
    },
    "subskills": [
      {
        "name": "Hex of Force",
        "description": "For each Combo ATK performed, the Valkyrie gains 4.0% Total DMG for 40s (max stacks: 5). Triggering this effect again resets the duration."
      },
      {
        "name": "Hex of Reburn",
        "description": "If 2 consecutive Combo ATK moves released are the same Combo ATK, the second one deals 30.0% more Fire DMG; if 2 consecutive Combo ATK moves released are 2 different Combo ATK moves, the second one restores 6.0 SP for the character upon hit."
      },
      {
        "name": "Hex of Rebirth",
        "description": "Auto-triggers before character dies (can be triggered 1 time per battle): Fully heals the character and makes her invincible for 1s. If triggered later than 30s after the battle starts, character additionally restores 30.0 SP.",
        "requiredRank": "s1"
      }
    ]
  },
  "ultimate": {
    "core": {
      "name": "Empyrean Sunder",
      "description": "Pulls in enemies and deal damage.\nImmobilizes all enemies for 11s and deals 1800% ATK of Fire DMG to them. Boosts the team's Elemental DMG against enemies hit by this skill by 30% for 15s, during which the deployed Valkyrie restores 1 SP per second, gains Ignore Interrupt and 35% Total DMG Reduction, while all enemies' Ignore Interrupt is lowered. The above effects do not stack with Combo ATK effects.\n\nActivation cost: 125 SP. CD: 5s."
    },
    "subskills": [
      {
        "name": "Hex of Breaching",
        "description": "When Azure Empyrea's Ultimate ends, all team members gain 16.0% Elemental Breach for 15s."
      },
      {
        "name": "Hex of Brilliance",
        "description": "Within 15s after Azure Empyrea's Ultimate ends, all team members additionally deal 50.0% ATK of Fire DMG when attack. This effect can only apply once per second against each target.",
        "requiredRank": "ss"
      },
      {
        "name": "Hex of Enervation",
        "description": "Enemies hit by Azure Empyrea's Ultimate suffer the vulnerability debuffs inflicted by Hex of Crucibles and Hex of Drowning and takes 30.0% more Lightning DMG for 15s."
      }
    ]
  },
  "evasion": {
    "core": {
      "name": "Taichi of Inertia",
      "description": "Quickly dodge enemy attacks. Can be performed twice in a rowWithin the first 1.2s after performing Ultimate Evasion, Valkyrie gains Ignore Interrupt, 80% Total DMG Reduction, and can directly perform the 4th sequence of Basic ATK (once only).Time Fracture: Ultimate Evasion triggers 3s of Time Fracture; CD 15s.Spirit Shield: Valkyrie gains a barrier that blocks the next incoming attack. Reset upon Ultimate Evasion."
    },
    "subskills": [
      {
        "name": "Calculated Gust",
        "description": "Shortens CD of Ultimate Evasion by 4.00s."
      },
      {
        "name": "Hex of Foresight",
        "description": "When Spirit Shield exist, character deals 35.0% more Total DMG.",
        "requiredRank": "ss1"
      }
    ]
  },
  "basic": {
    "core": {
      "name": "Yin and Yang",
      "description": "Tap the [ULT] or [ATK] button to attack enemies and gain Yin or YangThe first 3 sequences: Each sequence deals 170% ATK of Fire DMG.\n4th sequence: Deals 200% ATK of Fire DMG.\nTap [ATK]/[ULT] to unleash Solar Focus or Lunar Essence. The sum of Yin and Yang cannot not exceed 3; once this limit has been reached, Solar Focus or Lunar Essence can no longer be unleashed."
    },
    "subskills": [
      {
        "name": "Unbroken Fire",
        "description": "ATK Speed increases by 15.0%; the final hit of the 4th sequence of Basic ATK additionally deals 120.0% ATK of Fire DMG and ignites the target, dealing 70.0 Fire DMG per 0.5s for 8s."
      },
      {
        "name": "QTE: Radiant Entry",
        "description": "QTE: Triggers when an enemy is affected by Time Slow. Deals 5x100.0%+450.0% ATK of Fire DMG, then unleashes Lunar Essence 3 times."
      },
      {
        "name": "Hex of Unyielding",
        "description": "The first 3 sequences of Basic ATK grant Ignore Interrupt and 35.0% Total DMG Reduction; while unleashing the 4th sequence, character gains Iron Body and 80% Total DMG Reduction."
      }
    ]
  }
}
