{
  "id": "bn",
  "name": "Black Nucleus",
  "type": "biologic",
  "valkyrie": "bronya",
  "strengths": [
    "physical",
    "stun"
  ],
  "leader": {
    "core": {
      "name": "Complex Operations",
      "description": "Leader Bonus:\nComplex Operations: Shortens CDs of main effects triggered by whole team's Ultimate Evasion and Perfect Defense by 3.5s."
    },
    "subskills": [
      {
        "name": "Complex Operations",
        "description": "Shortens the CDs of primary effects triggered by Ultimate Evasions and Perfect Defense by 4.5s for the team.",
        "requiredRank": "ss"
      }
    ]
  },
  "special": {
    "core": {
      "name": "Switch: Mecha Smash",
      "description": "Switch skill unleashes a slam attack with robot arms.\nSlams enemies with robot arms, dealing 175% ATK of Physical DMG to enemies within the AOE."
    },
    "subskills": [
      {
        "name": "Hardened Chassis",
        "description": "Buffs the Switch Skill to deal 175%+175% ATK of Physical DMG."
      },
      {
        "name": "QTE-Field Suppression",
        "description": "QTE: Triggers when an enemy is knocked airborne or affected by Time Slow. Ground slams enemies within a large AOE, dealing 3x320% ATK of Physical DMG, then gain invisibility for 6s (invisibility is not triggered by normal evasions during QTE)."
      }
    ]
  },
  "passive": {
    "core": {
      "name": "Passive Skill",
      "description": "Passive bonuses apply automatically."
    },
    "subskills": [
      {
        "name": "Field Breach",
        "description": "Gain 39.0% Total DMG Multiplier when attacking an enemy from the side or from behind.",
        "requiredRank": "this"
      },
      {
        "name": "Target Locked",
        "description": "When attacked or when triggering Ultimate Evasion, 40% chance to apply Locked Mode onto the attacker, making it take 25.0% more Physical DMG for 4.5s.",
        "requiredRank": "this"
      },
      {
        "name": "Thermal Activation",
        "description": "The Valkyrie gains 30% Crit DMG. Each Crit hit additionally deals 30.0% ATK of Fire DMG.",
        "requiredRank": "ss"
      }
    ]
  },
  "ultimate": {
    "core": {
      "name": "Suppression Barrage",
      "description": "Unloads the entire arsenal to bombard the designated area.\nSuppression Barrage: Creates a small immobilizing field surrounding the target and bombards the AOE to deal 20x80% ATK of Physical DMG.\nSP Cost: 125"
    },
    "subskills": [
      {
        "name": "Mortar Cannon",
        "description": "Enhances Bombardment, with each hit dealing an additional 100% ATK of Physical DMG and 12.0% chance to ignite enemies, dealing 450 Fire DMG every 0.5s for 7s."
      },
      {
        "name": "Blinding Munitions",
        "description": "Stuns enemies 0.5s after being hit by Bombardment for 5.00s.",
        "requiredRank": "ss"
      }
    ]
  },
  "evasion": {
    "core": {
      "name": "Dimensional Interruption",
      "description": "Dodges sideways to evade enemy attacks and becomes invisible.\nDimensional Interruption: Enters 6s invisibility upon Ultimate Evasion. CD: 20s.\nInvisibility: Cannot be targeted by enemies; ignore all DMG taken when attacked; gain immunity against common debuffs; and greatly increased Move Speed and Attack Speed.\nInvisibility ends when tapping the [ATK] button, using weapon skills or Ultimates, or switching characters."
    },
    "subskills": [
      {
        "name": "Stealth Assassination",
        "description": "When invisible, character attacks gain 35.0% Physical DMG. Lasts until 2.80s after invisibility ends."
      },
      {
        "name": "Time Bomb",
        "description": "Ultimate Evasion drops 8 bomblets at the enemy's location that explodes after a short delay, dealing 80% ATK of Physical DMG."
      },
      {
        "name": "Particle Reset",
        "description": "Shortens CD of Dimensional Interruption by 4.0s.",
        "requiredRank": "this"
      }
    ]
  },
  "basic": {
    "core": {
      "name": "Charge: Shrapnel Shell",
      "description": "Charged cannon fire. Higher charge sequence deals greater DMG.\nArm Switch: Charging mode changes with type of equipped weapon.\nGuidance MOD: Equipping missile-type weapons transforms attacks to scatter shot shells. Each charge sequence increases the number of shells fired by 30%. Every shell deals a small AOE explosion. The 1st, 2nd, and 3rd charge sequences deal 50%, 60%, and 80% ATK of Physical DMG, respectively, and increases Interrupt."
    },
    "subskills": [
      {
        "name": "Precision Charge",
        "description": "Releasing the [ATK] button at the moment of entering the next charge sequence increases Crit Rate of this attack by 30.0%.",
        "requiredRank": "this"
      },
      {
        "name": "Flash Dodge",
        "description": "Force evasion when attacked during charging. Can be triggered once every 4.0s. Effect does not interrupt charging.",
        "requiredRank": "this"
      },
      {
        "name": "Primed Charge",
        "description": "Releasing the [ATK] button upon entering the 3rd charge sequence increases DMG of this attack by 20.0%, and gain 100% Move Speed for the next 3s.",
        "requiredRank": "sss"
      }
    ]
  }
}