{
  "id": "dk",
  "name": "Drive Kometa",
  "type": "psychic",
  "valkyrie": "bronya",
  "strengths": [],
  "leader": {
    "core": {
      "name": "Mental Sync",
      "description": "Leader Bonus:\nMental Sync: When Combo Hit Count exceeds 30, team gains 20% Crit Rate. PSY-type characters gain 20% Crit DMG."
    },
    "subskills": [
      {
        "name": "Mental Sync",
        "description": "When Combo Hit Count exceeds 30, team gains 26% Crit Rate. PSY-type characters gain 29% Crit DMG."
      }
    ]
  },
  "special": {
    "core": {
      "name": "Switch: Gravity Slam",
      "description": "Switch skill immediately unleashes a Shield Charge.\nShield Charge: 150% ATK of Physical DMG and knocks enemy into the air."
    },
    "subskills": [
      {
        "name": "Power Charge",
        "description": "Additionally deals 1,125 Physical DMG against enemies hit by Shield Charge."
      },
      {
        "name": "QTE: Obliterate",
        "description": "Triggers QTE when an enemy is affected by Time Slow. Creates a gravity warp in front to deal 600% ATK of small AOE Physical DMG and stun the enemies for 5.0s. Also pulls in nearby enemies for 1.8s.",
        "requiredRank": "1★"
      }
    ]
  },
  "passive": {
    "core": {
      "name": "Passive",
      "description": "Passive bonuses apply automatically.\nNo interruption when the shield is shattered by Physical DMG."
    },
    "subskills": [
      {
        "name": "Aegis of Inertia",
        "description": "Team gains a shield that absorbs Physical ATK DMG. Shield HP: 25.0% of Yamabuki's Max HP (Max: 2000). Shield can be reset with QTE or Ultimate.",
        "requiredRank": "1★"
      },
      {
        "name": "Gravity Vortex",
        "description": "Shield Active: When taking hits exceeding 300 Physical DMG, the exceeding amount is subject to 60.0% reduction. When shield is breached, paralyze nearby enemies for 2.0s. CD: 6s.",
        "requiredRank": "3★"
      },
      {
        "name": "Reinforced Barrier",
        "description": "Mecha Shield receives DEF equal to 100% of Yamabuki's DEF.",
        "requiredRank": "s"
      }
    ]
  },
  "ultimate": {
    "core": {
      "name": "Obliterate Mode",
      "description": "Lifts power restrictions on the Mech to enter Obliterate Mode (Burst).\nSP cost: 50. Instantly gathers and knocks up nearby enemies to deal 150%+400% ATK of Physical DMG. Resets shield and enter Obliterate Mode. Duration: 15s. Yamabuki Armor gains Iron Body during this period. Shield resets every 3s. CD: 25s.\n1st Strike: 100% Physical DMG.\n2nd Strike: 2x70% Physical DMG.\n3rd Strike: Warps gravity to deal 160% Physical DMG and Time Lock enemies within range, and gathers nearby enemies for 2s."
    },
    "subskills": [
      {
        "name": "Restructured Energy",
        "description": "When the Ultimate hits an enemy in the Crippling Field, stun it for 3s. When Space Warp hits an enemy in the Crippling Field, heal the team for 30 HP (Obliterate Mode: 2x30 HP).",
        "requiredRank": "3★"
      },
      {
        "name": "DEF Reboot",
        "description": "Triggering Perfect Defense resets the shield. Obliterate Mode: Team gains 50.0% Indirect Physical DMG Reduction buff.",
        "requiredRank": "6★"
      },
      {
        "name": "Space Warp",
        "description": "Shield active: Melee ATKs gain 25.0% Physical DMG and 10.0% Crit Rate. Valkyries protected by the shield on the field emit shockwaves that deal 100.0% Physical DMG against nearby enemies every 3s (interval reduced to 1.5s in Obliterate Mode).",
        "requiredRank": "1★"
      }
    ]
  },
  "evasion": {
    "core": {
      "name": "Super Gravity",
      "description": "Raises the shield to defend against frontal attacks.\nCounterstrike: Release the [Defense] button at the moment of the attack to unleash a counterstrike.\nPerfect Defense: Counterstrike triggers Time Fracture, slowing all enemies for 5s and accelerates the character's Move SPD by 50% and Attack SPD by 30% for 3s. Perfect Defense base CD: 15s.\nGravity Reflex: Raises shield faster and enters mobility mode more quickly."
    },
    "subskills": [
      {
        "name": "Reflective Shield",
        "description": "Can perform Counterstrike when defending against ranged attacks. Unleashes Shield Charge and ignites the enemy, dealing 154 Fire DMG every 0.5s for 10.0s."
      },
      {
        "name": "Reverse Trajectory",
        "description": "Reflects the thrown objects back to the ranged attacker upon starting defense, dealing 350% of the original damage."
      },
      {
        "name": "Field Propulsion",
        "description": "Recovers 4 SP for the whole team after Counterstrike.",
        "requiredRank": "ss"
      }
    ]
  },
  "basic": {
    "core": {
      "name": "Charge: Particle Cannon",
      "description": "Charged cannon fire that deals greater DMG with higher charge sequence.\nArm Switch: Charging mode changes with type of weapon equipped"
    },
    "subskills": [
      {
        "name": "Crippling Bolt",
        "description": "Uncharged Basic ATK generates a 15s Crippling Field that follows the target. Enemies within the field suffer reduced Ignore Interrupt, take 50.0% more shield DMG, and are weakened (deals 10% less DMG).",
        "requiredRank": "2★"
      },
      {
        "name": "Energy Overload",
        "description": "Increases charging speed by 50.0% but decreases Crit Rate by 50.0%.",
        "requiredRank": "s"
      }
    ]
  }
}
