{
  "id": "dp",
  "name": "Divine Prayer",
  "type": "psychic",
  "valkyrie": "kiana",
  "strengths": ["physical", "heal", "impair", "burst", "time mastery"],
  "leader": {
    "core": {
      "name": "Nebula Ward",
      "description": "Leader Bonus:\nNebula Ward: Team gains 20% Elemental DMG and takes 20% less Elemental DMG."
    },
    "subskills": [
      {
        "name": "Nebula Ward",
        "description": "Team gains 32% Elemental DMG and takes 26% less Elemental DMG."
      }
    ]
  },
  "special": {
    "core": {
      "name": "Combo: Star Arrow",
      "description": "Launches spin kick and charging kick attacks after 3 consecutive kicks.\nSpin Kick: 150% ATK of Physical DMG x3.\nCharging Kick: 200% ATK of Physical DMG and knocks enemies back."
    },
    "subskills": [
      {
        "name": "Switch: Star Flame",
        "description": "Switch entry unleashes a forward kick that deals 200% + 300% ATK of Physical DMG, and applies a 5.0s stun if hitting an enemy already knocked airborne."
      },
      {
        "name": "QTE: Aerolite Impact",
        "description": "QTE: Triggered when an enemy is paralyzed. Unleashes a powerful whirlwind kick, dealing 3,563 Physical DMG + 240% ATK of Physical DMG. If the last hit of the QTE successfully hits the enemy, heals team for 100 HP."
      },
      {
        "name": "Implosion",
        "description": "Combo ATKs gain 40.0% Crit Rate.",
        "requiredRank": "s"
      }
    ]
  },
  "passive": {
    "core": {
      "name": "Passive Skill",
      "description": "Passive bonuses automatically apply."
    },
    "subskills": [
      {
        "name": "Divine Penalty",
        "description": "When on standby, inflict Divine Penalty on a random enemy every 10s, dealing 1,103 Lightning DMG and Impairing the target to lower its DEF by 80.0% for 6.0s."
      },
      {
        "name": "Quasar",
        "description": "Enters the battle automatically right before a teammate dies and recovers her HP by 600. Can only be triggered once per stage.",
        "requiredRank": "sss"
      },
      {
        "name": "Divine Light",
        "description": "Switch entry dispels most debuffs from all characters and increases own DEF by 50.0% for 4.0s.",
        "requiredRank": "s"
      }
    ]
  },
  "ultimate": {
    "core": {
      "name": "Valkyrie Refuge",
      "description": "Activate divine energy burst to enter Holy Light mode.\nBurst: Consumes SP continuously to increase ATK. Time Fracture is active throughout the Burst.\nHoly Light: Once the sub-skill is activated, heals HP for the entire team every 0.5s.\nAt over 75 SP, consumes 20 SP to activate Ultimate and 10 SP/s afterwards. Duration: 60s or until SP is depleted, during which the SP consumption rate increases after 20s."
    },
    "subskills": [
      {
        "name": "Healing Spring",
        "description": "Heals the whole team for 67.2 HP every 0.5s during Burst. Effective on summoned characters (illusions, etc.)."
      },
      {
        "name": "Weihwasser",
        "description": "Upon Burst, instantly heal the whole team for 320 HP.",
        "requiredRank": "ss"
      },
      {
        "name": "Song of Alacrity",
        "description": "During Burst, the whole team gains 50% Move Speed and 30% Attack Speed.",
        "requiredRank": "ss"
      }
    ]
  },
  "evasion": {
    "core": {
      "name": "Time Fetter",
      "description": "Quickly cartwheels away to evade enemy attacks. Can be performed twice in a row.\nTime Fetters: Triggers upon Ultimate Evasion. Knocks the attacker airborne and inflicts Time Lock for 4s. CD: 8s."
    },
    "subskills": [
      {
        "name": "Frozen Time",
        "description": "Extends the duration of Time Fetters to 8.0s and bleeds enemy, dealing 7.0% ATK of Ice DMG every 0.5s."
      },
      {
        "name": "Nova Fissure",
        "description": "Ultimate Evasions heal the whole team for 30.0 HP."
      },
      {
        "name": "Time Bender (DP)",
        "description": "Ultimate Evasion's effects can be triggered 1 more time(s). CD is decreased by 3.0s.",
        "requiredRank": "s"
      }
    ]
  },
  "basic": {
    "core": {
      "name": "Meteor Kata",
      "description": "4-kick attack sequence.\n1st Sequence: 100% ATK of Physical DMG.\n2nd Sequence: 100% ATK of Physical DMG.\n3rd Sequence: 100% ATK of Physical DMG.\n4th Sequence: 300% ATK of AOE Physical DMG."
    },
    "subskills": [
      {
        "name": "Comet Ward",
        "description": "Basic ATKs have a 15.0% chance of weakening enemies, decreasing their ATK by 70.0% for 4s."
      },
      {
        "name": "Nebula Uplink",
        "description": "Basic attacks that score a crit have a 30.0% chance to heal the whole team for 50 HP."
      }
    ]
  }
}
