{
  "id": "fs",
  "name": "Flame Sakitama",
  "type": "biologic",
  "valkyrie": "sakura",
  "strengths": ["fire dmg", "time mastery", "ignite"],
  "leader": {
    "core": {
      "name": "Eternal Cycle",
      "description": "Leader Bonus:\nEternal Cycle: Team gains 25% DEF in battle. BIO-type characters gain 6% Max HP."
    },
    "subskills": [
      {
        "name": "Eternal Cycle",
        "description": "Team gains 40% DEF in battle. BIO-type characters gain 9% Max HP.",
        "requiredRank": "s"
      }
    ]
  },
  "special": {
    "core": {
      "name": "Combo: Firewind",
      "description": "Leaping Slash ATK with both blades drawn.\nCombo Slash: 150% ATK of Physical DMG.\nCombo Follow-up ATK: Pause tapping [ATK] after Combo ATK and tap [ATK] again when the circle appears.\nCombo Follow-up ATK deals 220% ATK of Fire DMG and ignites enemies hit to deal 50 Fire DMG per 10s."
    },
    "subskills": [
      {
        "name": "Asura",
        "description": "Combo follow-up attacks increase Fire DMG by 25% and Ice and Lightning DMG by 10% for 15 sec."
      },
      {
        "name": "QTE: Backfire",
        "description": "Triggers QTE when enemy is paralyzed, dealing 50.0% ATK x [ATK] button tap count (up to 12) + 100% ATK of Fire DMG."
      },
      {
        "name": "Crimson Sunset",
        "description": "Switch entry triggers a 3.1s Time Fracture. CD: 32s. This effect can only be activated 10s after the stage begins.",
        "requiredRank": "s"
      }
    ]
  },
  "passive": {
    "core": {
      "name": "Passive",
      "description": "Passive bonuses apply automatically.\nAfter certain moves (4th hit of Basic ATK or Combo ATK), tap the [ATK] button when a flashing circle appears on the character to trigger follow-up attacks, dealing massive Fire DMG."
    },
    "subskills": [
      {
        "name": "Ancient Dream",
        "description": "Ignores combo interruption once. Can be triggered once every 30s. Applies for the whole team.",
        "requiredRank": "s"
      },
      {
        "name": "Artful Blade",
        "description": "Basic follow-up attacks increase character's Zanshin by 225 upon hitting a target. For every 200 Zanshin, gain 17% (up to 68%) Total DMG Multiplier. When the character is deployed, consume 30 Zanshin per second.",
        "requiredRank": "ss"
      },
      {
        "name": "Aerial Kill",
        "description": "Attacks against Time Slowed enemies gain 30.0% Physical and Elemental DMG."
      }
    ]
  },
  "ultimate": {
    "core": {
      "name": "Yae's Inferno",
      "description": "Attacks a random enemy multiple times and inflicts Time Lock to enemies within a large AOE.\nGuren Lotus: Attacks a random enemy 8 times, with each time dealing 200% ATK of Fire DMG.\nKarmic Flame: 400% ATK of Fire DMG to enemies in a large area and inflicts Time Slow for 4.5s.\nBlazing Tempo: Empowers character from Iron Body and faster attack for 9s. Follow-up attacks can be triggered without having to tap the [ATK] button at the precise time."
    },
    "subskills": [
      {
        "name": "Surya's Burn",
        "description": "Each hit of the Ultimate combo strike deals an additional 200% ATK of Fire DMG."
      },
      {
        "name": "Red Cloud",
        "description": "For 10s after casting Ultimate, character attacks gain 19% Total DMG Multiplier.",
        "requiredRank": "s"
      },
      {
        "name": "Phoenix Blade",
        "description": "Every Basic follow-up ATK deals additional 19% ATK of Fire DMG.",
        "requiredRank": "sss"
      }
    ]
  },
  "evasion": {
    "core": {
      "name": "Blazing Dance",
      "description": "Quickly cartwheels away to evade enemy attacks.\nTime Fracture: Triggers Time Fracture upon an Ultimate Evasion, slowing all enemies for 3s. CD: 15s."
    },
    "subskills": [
      {
        "name": "Hazy Moon",
        "description": "Upon triggering an Ultimate Evasion, gains Ignore Interrupt and 30.0% Total DMG Multiplier for 4s."
      },
      {
        "name": "Shokudai Kiri",
        "description": "Shortens CD of Time Fracture by 2.5s."
      }
    ]
  },
  "basic": {
    "core": {
      "name": "Ryuka Blade",
      "description": "Quick 5-sequence slash. Evading during the first 3 sequence will not break the sequence.\n1st to 3rd Sequences: 100%+100%+150% ATK of Physical DMG.\n4th Sequence: 150% ATK of Physical DMG.\n5th Sequence: 150% ATK of Physical DMG.\nBasic Follow-up ATK: After the 4th Sequence, wait for a flashing circle to appear and then immediately tap [ATK].\nBasic Follow-up ATK deals 650% ATK of Fire DMG and Ignites the target to further deal 50 Fire DMG per 0.5s for 10s."
    },
    "subskills": [
      {
        "name": "Transcendent Realms",
        "description": "When Combo Hit Counts reach 30 and 50, each sequence of the Basic ATK deals another 30.0% and 50.0% Fire DMG, respectively. Character also gains Ignore Interrupt during Basic ATKs."
      },
      {
        "name": "Imperial Tachi",
        "description": "First 4 sequences of the Basic ATK gain 30% Attack Speed. For the 4th sequence, gain 80% Total DMG Reduction and greatly increased Ignore Interrupt."
      },
      {
        "name": "Living Sword",
        "description": "If basic follow-up attacks score a hit, character gains 3.5 SP.",
        "requiredRank": "ss"
      }
    ]
  }
}
