{
  "id": "io",
  "version": "5.2",
  "name": "Infinite Ouroboros",
  "type": "mecha",
  "valkyrie": "mobius",
  "strengths": ["lightning dmg", "time mastery", "aerial"],
  "leader": {
    "core": {
      "name": "Infinite Fate",
      "description": "Leader Bonus:Ranged attackers on the team deal 17.0% bonus Total DMG; When summoned entities are present, team deals 20.0% bonus Lightning DMG. Persists for 25s (can be refreshed)."
    },
    "subskills": [
      {
        "name": "Eternal Tomb",
        "description": "Team's ranged ATKs deal 27.0% more Total DMG. When a summoned entity is present, team deals 30.0% more Lightning DMG. Lasts for 25s (can be refreshed).",
        "requiredRank": "s3"
      }
    ]
  },
  "special": {
    "core": {
      "name": "Combo: Distorting Scale",
      "description": "Release part of the Ouroboros to launch attacks. Combo ATK:1st Sequence: Deals 150% + 175% ATK of Lightning DMG. Tap [ATK] after casting to connect an Enhanced Basic ATK that deals 175% ATK of Lightning DMG.2nd Sequence: Deals 375% ATK of Lightning DMG. Tap [ATK] after casting to connect an Enhanced Basic ATK that deals 175% ATK of Lightning DMG.3rd Sequence: Deals 425% ATK of Lightning DMG. Tap [ATK] after casting to connect an Enhanced Basic ATK that deals 175% ATK of Lightning DMG.Can only continue to the next Combo ATK sequence within 5s of using Combo ATK. If more than 5s has elapsed, the next Combo ATK will revert to the 1st Sequence.Can continue to use Enhanced Basic ATK for a short time after Combo ATK evasion.While Enhanced Basic ATK is active, host's Move Speed is boosted and a barrier is formed that blocks 1 ATK.Combo ATK's 1st Sequence generates an Object X (summoned entity) that persists for 20s. It reduces the Move Speed of nearby enemies as well as slowly pulling them toward it. Triggering it again resets the duration."
    },
    "subskills": [
      {
        "name": "Invisible Spike",
        "description": "Boosts Total Combo ATK DMG by 25.0%. Valkyrie takes 60.0% less Total DMG."
      },
      {
        "name": "Bewitching Venom",
        "description": "Boosts Total Combo ATK DMG by 15.0%. Each time an enemy is hit, restores 0.8 SP.",
        "requiredRank": "ss"
      },
      {
        "name": "Reptilian Gaze",
        "description": "For 3.5s after hitting an enemy with a Combo ATK, Combo ATKs deal 25.0% more Lightning DMG. Can stack up to 2 times. Triggering repeatedly resets the duration. Casting Ultimate restores max number of stacks."
      }
    ]
  },
  "passive": {
    "core": {
      "name": "Undying Curse",
      "description": "Character automatically gains passive bonuses.[Genesis Seed]: Up to 3 may be present at once. Using Combo ATK consumes 1 seed. 4th Sequence of Basic ATK restores 1 seed on hit."
    },
    "subskills": [
      {
        "name": "Evolution's Source",
        "description": "Gain 36.0 initial SP in battle. This bonus triggers once every 10 minutes in Open World."
      },
      {
        "name": "Chaotic Flow",
        "description": "Gain 80.0 HP and 1 [Genesis Seed] for each enemy killed."
      },
      {
        "name": "Sunken Mind",
        "description": "Enemies within the [Umbra of Ouroboros] take 20.0% more Lightning DMG from this Valkyrie (independent effect)."
      }
    ]
  },
  "ultimate": {
    "core": {
      "name": "Honkai Activation",
      "description": "After completely transforming into Ouroboros form, unleash a powerful attack with a large AOE.Activation cost: 100 SP. CD: 20s.Transform into Ouroboros and release lightning over a large area, dealing 420% × 5 + 50% × 3 ATK of Lightning DMG and restoring the max number of [Genesis Seeds]. Expand Umbra of Ouroboros for 12s. While Umbra of Ouroboros is present, Lightning DMG is boosted by 25%, and Enhanced Basic ATKs connected to Combo ATKs become Surging ATKs that deal 110% × 5 AKT of Lightning DMG and restore 1 [Genesis Seed] on hit.When Ultimate is cast, all skill timers of Valkyries and enemies as well as the stage timer are paused."
    },
    "subskills": [
      {
        "name": "Collapsing Truth",
        "description": "While [Umbra of Ouroboros] is active, up to 5 enemies who were hit by Ultimate or Combo ATK are linked, and damage from Valkyrie's Combo ATKs, Ultimates, or Enhanced Basic ATKs will be transferred between them at a rate of 16.0% (effect: HP loss). While [Umbra of Ouroboros] is active, Valkyrie's Combo ATK DMG multiplier is increased by 360.0%."
      },
      {
        "name": "Craving of the Dead",
        "description": "While [Umbra of Ouroboros] is active, Enhanced Basic ATKs connected to Combo ATKs, as well as Surging ATKs have 50.0% × 5 higher Lightning DMG multipliers.",
        "requiredRank": "s2"
      },
      {
        "name": "Scorn of the Living",
        "description": "Ultimate deals 40.0% more Total DMG. Enemies in [Umbra of Ouroboros] have ATK Speed reduced by 20.0%."
      }
    ]
  },
  "evasion": {
    "core": {
      "name": "Flickering Shadow",
      "description": "Evade enemy attacks up to twice in a row.Successful Ultimate Evasion triggers 2.5s Global Time Fracture (CD: 10s) and induces submerged mode. Tap [ATK] in this mode to unleash a Surging ATK that deals 110% × 5 ATK of Lightning DMG and restores 1 [Genesis Seed] on hit. Submerged mode lasts for a max of 2.5s."
    },
    "subskills": [
      {
        "name": "Simulated Sacrifice",
        "description": "When Object X is present, enemies on the field take 5.0% more Total DMG. When Object X is generated and the refresh and duration time runs out, 150.0% Lighting DMG is dealt to surrounding enemies.",
        "requiredRank": "sss"
      },
      {
        "name": "Seething Bloodlust",
        "description": "While Object X is present, Valkyrie's ATK Speed is boosted by 30.0%, and enemies on the field take 25.0% more Lighting DMG."
      }
    ]
  },
  "basic": {
    "core": {
      "name": "Devouring Darkness",
      "description": "The spikes that form when Umbra of Ouroboros is used inflict Ranged ATKs.Basic ATK:1st Sequence: Deals 80% ATK of Lightning DMG.2nd Sequence: Deals 40% × 3 ATK of Lighting DMG.3rd Sequence: Deals 100% ATK of Lightning DMG.4th Sequence: Deals 125% ATK of Lighting DMG.Evading after any of the Basic ATK's first 3 sequences allows you to proceed to the next sequence."
    },
    "subskills": [
      {
        "name": "Withered Heart",
        "description": "When Umbra of Ouroboros is not active, Enhanced Basic ATK connected to Combo ATK restores 7.0 SP on hit."
      },
      {
        "name": "QTE: Piercing Fang",
        "description": "QTE: Triggered when enemies are Time Slowed or take 15 hits within 3s Deals 2 × (400.0% + 10.0% × 15) Lighting DMG while restoring 1 [Genesis Seed] and creating an Object X. On hit, QTE boosts her Lighting DMG by 45.0%, as well as making enemies 16% more susceptible to her Lighting DMG (effects stack independently). Lasts for 16s. Triggering it again resets the duration."
      },
      {
        "name": "Deathless Cloak",
        "description": "During 3rd/4th sequences of Basic ATK, Valkyrie has higher Ignore Interrupt and takes 30.0% less Total DMG."
      }
    ]
  }
}
