{
  "id": "kasumi",
  "name": "Darkbolt Jonin",
  "type": "biologic",
  "valkyrie": "sakura",
  "strengths": [
    "lightning dmg",
    "time mastery",
    "paralyze"
  ],
  "leader": {
    "core": {
      "name": "The Sahā World",
      "description": "Leader Bonus:\nTeam gains 23% Lightning DMG and 13% total DMG."
    },
    "subskills": [
      {
        "name": "The Sahā World",
        "description": "Team deals 30.0% more Lightning DMG and 15% bonus Total DMG.",
        "requiredRank": "sss"
      }
    ]
  },
  "special": {
    "core": {
      "name": "Combo: Naraka Finisher",
      "description": "Tap & hold [ATK] to strike a deadly blow.\nTap & hold [ATK] to consume 100 Zakti and unleash Naraka Finisher.\nNaraka Finisher can be unleashed in quick succession, dealing 100% ATK of Lightning DMG against enemies within range.\nNaraka Finisher additionally restore 1.4 SP upon each hit."
    },
    "subskills": [
      {
        "name": "Yaksha Rush",
        "description": "Each cast of Naraka Finisher boosts Total DMG dealt by Naraka Finisher by 12.0% for 2s, 6 stacks max. Each stack's duration is independent of others'.",
        "requiredRank": "sss"
      },
      {
        "name": "Raksha AMP",
        "description": "Naraka Finisher deals 15.0% more Lightning DMG against enemies below 30% HP."
      },
      {
        "name": "Sura's Retribution",
        "description": "Each hit of Naraka Finisher deals 50.0% ATK of bonus Lightning DMG."
      }
    ]
  },
  "passive": {
    "core": {
      "name": "Eight Dukkha",
      "description": "Passive bonuses apply automatically.\nZakti: Starts at 0 and maxes at 500. Passive regen: 10 per second."
    },
    "subskills": [
      {
        "name": "Branded for Hate",
        "description": "Gains 30.0% Total DMG against enemies with Darkbolt Mark."
      },
      {
        "name": "Undying Love",
        "description": "Auto-triggers before the Valkyrie dies, activating an invincible Blink status and restoring 1.5% HP every 0.5s for 5s. CD: 60s; CD starts when the Blink status ends."
      },
      {
        "name": "Endless Desire",
        "description": "Each kill by Naraka Finisher recovers 150.0 Zakti."
      }
    ]
  },
  "ultimate": {
    "core": {
      "name": "Raksha's Rage",
      "description": "Raksha's Rage unleashes Rakshamaru's might to dominate the battlefield.\nRakshamaru is summoned to smite enemies within a large AOE before her, dealing 300%+80%+6x30% ATK of AOE Lightning DMG.\nTap [ULT] again within 12s since Rakshamaru's appearance to perform Samsara of Death, dealing 7x120%+7x180% ATK of AOE Lightning DMG and paralyzing enemies for 4s upon hit.\nSamsara of Death boots Ignore Interrupt and grants 40% Total DMG Reduction for 12s.\nCD: 20s. The first activation costs 100 SP, while the second costs 0 SP."
    },
    "subskills": [
      {
        "name": "Hungering Wraith",
        "description": "The 1st sequence of Rakshamaru attack enhances Zakti regen rate to 12.0 per 0.1s for 7s."
      },
      {
        "name": "Tiryag's Impulse",
        "description": "Raksamaru's 1st hit inflicts Conductive on the target, which makes it take 40.0% more Lightning DMG for 12s."
      },
      {
        "name": "Ashura's Gift",
        "description": "Summoning Raksamaru recovers 400 Zakti."
      }
    ]
  },
  "evasion": {
    "core": {
      "name": "Raijin's Blink",
      "description": "Lightning imbued evasion.\nUltimate Evasion triggers Raijin's Blink.\nRaijin's Blink: Creates a Lightning imbued shadow at the starting point; the shadows pulls in enemies and deals 50% ATK of Lightning DMG during its existence, and explodes after 3s to deal 400% ATK of Lightning DMG, triggering a global Time Fracture that lasts 3s.\nOnce Raijin's Blink is triggered, Darkbolt Jonin enters Blink status for 5s, during which she stays invisible and can sprint; while sprinting, her Jonin Finisher can be cast by tapping [ATK] to deal 6x50% ATK of AOE Lightning DMG. Jonin Finisher restores 60 Zakti energy and has an extra 3 SP upon hit.\nCD: 15s."
    },
    "subskills": [
      {
        "name": "Fusuikami's Bliss",
        "description": "Raijin's Blink's CD is reduced by 4.0s."
      },
      {
        "name": "Narukami's Curse",
        "description": "Raijin's Blink explosion deals 30.0% more Lighting DMG. Jonin Finisher deals 40.0% more Lightning DMG."
      },
      {
        "name": "Wakaikami's Vigor",
        "description": "Raijin's Blink restores 100 Zakti energy when procced."
      }
    ]
  },
  "basic": {
    "core": {
      "name": "Garyu Stance",
      "description": "Melee moves that incorporate both kenjustsu and taijutsu.\n1st Sequence: 50% ATK of Physical DMG + 40% ATK of Lightning DMG. Restores 30 Zakti energy upon hit.\n2nd Sequence: 70% ATK of Physical DMG + 130% ATK of Lightning DMG. Restores 40 Zakti energy upon hit.\n3rd Sequence: 100% ATK of Physical DMG + 160% ATK of Lightning DMG. Restores 60 Zakti energy upon hit and an extra 3 SP upon hit.\n4th Sequence: 130% ATK of Physical DMG + 200% ATK of Lightning DMG. Restores 70 Zakti energy upon hit and an extra 5.5 SP upon hit."
    },
    "subskills": [
      {
        "name": "Electrified Razor",
        "description": "During the 3rd & 4th sequences of Basic ATK, the Valkyrie gains Ignore Interrupt and takes 40.0% less Total DMG; the last hit of Basic ATK 4th sequence paralyzes the target for 0.5s."
      },
      {
        "name": "QTE: Shiden Blast",
        "description": "Triggered off Ignited enemies. Deals 700.0% ATK of AIE Lightning DMG and Paralyzes enemies for 1.0s."
      }
    ]
  },
  "sp": {
    "core": {
      "name": "Darkbolt Pursuit",
      "description": "Tap [ATK] when a light circle appears on the character to strike enemies with lethal kunai.Darkbolt Pursuit: Cast kunai to deal 4x20% ATK of AOE Lightning DMG and inflict Darkbolt Marks (lasts 30s) upon hit.QTE & the 1st sequence of Rakshamaru attacks can also inflict Darkbolt Marks.Inflicting Darkbolt Marks on a marked enemy again resets its duration.Immediately after unleashing Darkbolt Pursuit, tap [ATK] to connect Jonin Finisher, or hold [ATK] to connect Naraka Finisher."
    },
    "subskills": [
      {
        "name": "Biting Ember",
        "description": "After unleashing Darkbolt Pursuit, the Valkyrie gains 20.0% Total DMG for 30s. Triggering this effect again to reset the duration.",
        "requiredRank": "s"
      },
      {
        "name": "Lingering Light",
        "description": "Naraka Finisher gains expanded range and faster ATK Speed. Each Naraka Finisher summons a lightning bolt that additionally deals 220.0% ATK of Lightning DMG.",
        "requiredRank": "ss"
      },
      {
        "name": "Jonin's Lantern",
        "description": "Zakti starts at 400 and maxes at 600.",
        "requiredRank": "sss"
      }
    ]
  }
}