{
  "id": "ma",
  "name": "Midnight Absinthe",
  "type": "imaginary",
  "valkyrie": "raven",
  "strengths": [
    "fire dmg",
    "time mastery"
  ],
  "leader": {
    "core": {
      "name": "Midnight Gathering",
      "description": "Leader Bonus:Boosts team's Ultimate Fire DMG by 10.0% as well as increasing the team's Max HP by 10.0%."
    },
    "subskills": [
      {
        "name": "Midnight Gathering",
        "description": "Team's Ultimate Fire DMG increased by 15.0%. Team's Max HP increased by 15.0%.",
        "requiredRank": "s"
      }
    ]
  },
  "special": {
    "core": {
      "name": "Charged: Heartpiercer",
      "description": "Hold [ATK] to release Charged ATK.Hold [ATK]: Triggers Charged ATK Shoots 6 Feather Blades in all directions, each dealing 20% ATK of Fire DMG.Then deals 250% ATK of Fire DMG to surrounding enemies, and temporarily pulls in enemies in front of her. Also gathers all Feather Arrows/Feather Blades/Feathers on the battlefield and earns a corresponding number of [Night Roamer] Enhancement stacks.Tap [ATK] immediately after using Charged ATK to connect to Basic ATK's 5th sequence."
    },
    "subskills": [
      {
        "name": "Bird of Prey",
        "description": "When performing Charged ATK, take 40.0% less Total DMG."
      },
      {
        "name": "Stinger",
        "description": "On hit, Charged ATK boost Total DMG by 40.0% for 10s. Can be refreshed repeatedly."
      },
      {
        "name": "Mockingbird",
        "description": "When charge recovery hit enemies, if 15 or more Feather Arrows/Feather Blades/Feathers are recovered, restores 12.0 SP. CD: 2s.",
        "requiredRank": "ss"
      }
    ]
  },
  "passive": {
    "core": {
      "name": "Ominous Wings",
      "description": "Passive bonuses apply automatically.Balanced bow wielder who has up to 2 shooting chances.One is restored every 10s if less than 2 remain.Corrected modifier of normal shooting: 100%.Corrected modifier of aimed shooting: 100%.When she picks up Feather Arrows/Feather Blades/Feathers on the battlefield, gain [Night Roamer] stacks (up to 20). Lasts for 10s. Repeatedly gaining stacks extends and refreshes the duration.10 stack bonus: Deal 10% bonus Fire DMG.15 stack bonus: Deal 15% bonus Fire DMG.20 stack bonus: Deal 20% bonus Fire DMG."
    },
    "subskills": [
      {
        "name": "Red Sunrise",
        "description": "When Weapon Skill hits the weakspot on IMG-type enemy [Nihilus Seed], its current phase will be insta-killed if it has less than 20% HP."
      },
      {
        "name": "Sea Breeze",
        "description": "When teammates hit enemies with Charged/Combo/Ultimate ATKs while Valkyrie is on standby, team's Fire DMG is increased by 30.0%. Lasts for 5.0s. Generates 3 Feathers that can be collected. CD: 2s.",
        "requiredRank": "ss"
      },
      {
        "name": "Sazerac",
        "description": "Total DMG dealt by Ultimate and Weapon Skills is boosted by 30.0%. Hitting an enemy weakspot with an arrow drops 6 Feathers that can be collected.",
        "requiredRank": "sss"
      }
    ]
  },
  "ultimate": {
    "core": {
      "name": "Nightbird's Call",
      "description": "Fire a powerful shot at enemies after unleashing a multi-sequence ATK.Midnight Absinthe hides in the flock of crows, and quickly launches an assault that deals 6 × 150% ATK of Fire DMG to enemies. Then shoots an arrow at the ground that deals 300% ATK of Fire DMG to the target and then explodes dealing 700% ATK of Fire DMG to surrounding enemies. Clears all [Night Roamer] stacks, and simultaneously creates a cloud of smoke over the battlefield that lasts for 18s.When enemies in the smoke take DMG from her teammates' ATK or her own Weapon Skills, an explosion that deals 600% ATK of Fire DMG  will be triggered with a 1s delay. This DMG counts as Midnight Absinthe's Ultimate DMG.CD: 4s.Activation cost: 100 SP. CD: 20s."
    },
    "subskills": [
      {
        "name": "Paradise",
        "description": "Enemies affected by the smoke take 35.0% more Fire DMG. Lasts for 18s.",
        "requiredRank": "s"
      },
      {
        "name": "Midnight Kiss",
        "description": "When enemies in the smoke are hit by Combo/Charged/Ultimate ATKs, a fire is sparked that deals 40.0% ATK of Fire DMG per second for 5s.Triggering it again resets the duration."
      },
      {
        "name": "Last Word",
        "description": "Ultimate boosts team Fire DMG by 30.0% for 18s.",
        "requiredRank": "s"
      }
    ]
  },
  "evasion": {
    "core": {
      "name": "Enchanting Requiem",
      "description": "Evade enemy attacks up to twice in a row.Ultimate Evasion: Trigger Global Time Fracture for 3s. CD: 15s.Tap [ATK] immediately after Ultimate Evasion to connect to Basic ATK's 3rd Sequence."
    },
    "subskills": [
      {
        "name": "London Fog",
        "description": "A [Bounty Coin] will drop when an enemy is killed. Picking it up restores 50.0 HP to the Valkyrie (only effective for Midnight Absinthe)."
      },
      {
        "name": "Mojito",
        "description": "CD of Ultimate Evasion skill is 4.0s shorter."
      },
      {
        "name": "Golden Dream",
        "description": "When Ultimate Evasion Skill is triggered, deals 50.0% ATK of Fire DMG to surrounding enemies and boosts Move Speed by 15.0%. Lasts for 3s.",
        "requiredRank": "s"
      }
    ]
  },
  "basic": {
    "core": {
      "name": "Silenced Flechette",
      "description": "Use a bow to shoot at enemies.1st Sequence: 3 Feather Arrows, each dealing 20% ATK of Fire DMG.2nd Sequence: 2 combo hits, dealing 50% + 70% ATK of Fire DMG.3rd Sequence: 3 combo hits, dealing 40% + 40% + 200% ATK of Fire DMG.4th Sequence: 4 Feather Arrows, each dealing 70% ATK of Fire DMG.5th Sequence: 5 Feather Arrows, each dealing 50% ATK of Fire DMG.Feather Arrows shot from the bow will remain on the field. There can be no more than 20 Feather Arrows/Feather Blades/Feathers on the field at once."
    },
    "subskills": [
      {
        "name": "Angel Face",
        "description": "When Feather Arrows/Feather Blades/Feathers are present, team deals 25.0% bonus Fire DMG."
      },
      {
        "name": "Pink Lady",
        "description": "When [Night Roamer] is active, Total DMG taken is reduced by 30%. When there are full stacks of [Night Roamer], Total DMG taken is further reduced by 30%, and Fire DMG dealt is increased by 15.0%. 2 additional ATKs can be dealt after Basic ATK's 5th sequence.",
        "requiredRank": "s"
      },
      {
        "name": "QTE: Black Tulip",
        "description": "QTE is triggered when Enemies are Time Slowed. Deals 800.0% ATK of Fire DMG. QTE leaves 6 Feather Blades on the field."
      }
    ]
  }
}