{
  "id": "mpe",
  "name": "Miss Pink Elf♪",
  "type": "psychic",
  "valkyrie": "elysia",
  "strengths": [
    "physical",
    "time mastery",
    "fast atk"
  ],
  "leader": {
    "core": {
      "name": "An Ode to Love and Compassion",
      "description": "Leader Bonus:Team deals 15.0% bonus Total Shield DMG. Combo/Charged ATKs from any team member have 10.0% bonus Crit Rate."
    },
    "subskills": [
      {
        "name": "An Ode to Love and Compassion",
        "description": "Team deals 25.0% bonus Total Shield DMG. Combo/Charged ATKs from any team member have 15.0% bonus Crit Rate."
      }
    ]
  },
  "special": {
    "core": {
      "name": "Charged ATK: An Oath to Wind and Moon",
      "description": "Hold [ATK] to cast Charged Shot: Cupid's Bolt. Tap [ATK] repeatedly afterwards to repeat Cupid's Bolt.Cupid's Bolt has 2 sequences in normal form and 3 sequences when Flawless Dome is active.1st Sequence: 200% ATK of Physical DMG.2nd Sequence: 210% ATK of Physical DMG.3rd Sequence: 500% ATK of Physical DMG.Each cast of Cupid's Bolt costs 100 Infatuation. Cupid's Bolt can detonate Crystalline Seeds of the target, dealing 100% ATK of Physical DMG to enemies within a 4-meter range. The detonation will spread to Crystalline Seeds on enemies nearby and does not consume Crystalline Seeds. Detonation CD: 1s."
    },
    "subskills": [
      {
        "name": "Moonlight's Elegance",
        "description": "While below 50% HP, Miss Pink Elf♪ takes 20.0% less Total DMG. During her Charged ATK, she takes 30.0% less Total DMG. Charged ATKs in normal form restore 3.0 SP on hit."
      },
      {
        "name": "Night Dew's Serenity",
        "description": "Charged ATKs deal 15.0% bonus Crit DMG. When a detonated Crystalline Seed causes another to explode, the second explosion deals 20.0% bonus Total DMG.",
        "requiredRank": "sss"
      },
      {
        "name": "Snowflakes' Swirling",
        "description": "On hit, Charged ATKs boost Physical DMG by 15.0% for 8s. Can be refreshed."
      }
    ]
  },
  "passive": {
    "core": {
      "name": "A Saga of Origins and Endings",
      "description": "Passive bonuses apply automatically.Infatuation maxes at 400 and 30 is restored per second.Balanced archer with up to 2 shooting chances (one is restored every 10s if less than 2).When Ultimate is not in cooldown and within 5s of casting a Weapon Skill, Ultimate costs 30% less SP and restores 100 Infatuation (200 if Flawless Dome is active). In addition, tapping [ATK] after using Ultimate can cast Cupid's Bolt.Corrected modifier of non-aimed shooting: 100%.Corrected modifier of aimed shooting: 100%."
    },
    "subskills": [
      {
        "name": "Dawn's Glory",
        "description": "Weapon Skills have 20.0% higher Crit Rates. Hitting an enemy weakspot boosts the Crit Rate of this attack by 60.0%."
      },
      {
        "name": "Star's Radiance",
        "description": "Miss Pink Elf♪ starts with 400.0 Infatuation.",
        "requiredRank": "s2"
      },
      {
        "name": "Time's Ballad",
        "description": "Miss Pink Elf♪ deals 15.0% bonus Total DMG to enemies with Crystalline Seeds. Attacks by teammates against enemies with Crystalline Seeds restore 0.5 SP for Miss Pink Elf♪. CD: 1s.",
        "requiredRank": "ss"
      }
    ]
  },
  "ultimate": {
    "core": {
      "name": "The Beginning of You and I",
      "description": "Create a Flawless Dome which enhances Miss Pink Elf♪'s abilities.Shoot a magical arrow that creates a Flawless Dome for 12s.When Flawless Dome is active, Miss Pink Elf♪ is enhanced:She deals 15% bonus Physical DMG and has a 10% bonus Crit Rate.Infatuation maxes at 600 and casting Ultimate fully restores it.The 3rd sequence of Cupid's Bolt is enhanced and every sequence can trigger a ricochet. The ricochets of the 1st/2nd/3rd sequence deal 200%/200%/200%+200% ATK of Physical DMG respectively (only under Flawless Dome).Casting Ultimate pauses all skill timers for Miss Pink Elf♪ and enemies as well as the stage timer.Activation Cost: 100 SP. CP: 20s."
    },
    "subskills": [
      {
        "name": "Earth's Blessing",
        "description": "While Flawless Dome is active, Miss Pink Elf♪ restores 3.0 bonus Infatuation per 0.1s."
      },
      {
        "name": "Elysia's Allure",
        "description": "While Flawless Dome is active, ricochets of her Charged ATK deal 20.0% bonus Total DMG.",
        "requiredRank": "ss"
      },
      {
        "name": "Eternity's Embrace",
        "description": "Casting Weapon Skills or Ultimate boosts Total DMG by 15.0% for 15s. Can be refreshed."
      }
    ]
  },
  "evasion": {
    "core": {
      "name": "A Blessing from Heaven and Earth",
      "description": "Quickly dodge enemy attacks up to twice in a row.Successful Ultimate Evasions can trigger the Ultimate Evasion Skill, inducing 3s of global Time Fracture and restoring 50Infatuation. CD: 18s.Evading while Basic ATK is in progress does not break the sequence."
    },
    "subskills": [
      {
        "name": "Spring's Sweetness",
        "description": "Miss Pink Elf♪ has a 20.0% higher Crit Rate. Within 5s of casting evasion or Weapon Skill, Charged Shot's ricochet has a 10.0% higher Crit Rate."
      },
      {
        "name": "Maiden's Charm",
        "description": "Triggering Ultimate Evasion Skill restores 50.0 bonus Infatuation."
      },
      {
        "name": "Candle's Fragrance",
        "description": "When Miss Pink Elf♪ takes fatal DMG (and her HP drops to 0), a flawless crystal is created to revive her, restoring 100.0% HP. CP: 180s."
      }
    ]
  },
  "basic": {
    "core": {
      "name": "An Arrow for Flower and Fowl",
      "description": "Shoot arrows with a bow.1st Sequence: 100% ATK of Physical DMG.2nd Sequence: 60% + 60% ATK of Physical DMG.3rd Sequence: 150% ATK of Physical DMG.4th Sequence: 200% ATK of Physical DMG.Each hit of Basic ATK applies a Crystalline Seed to the target (up to 4). Crystalline Seeds remain effective throughout the battle."
    },
    "subskills": [
      {
        "name": "Blossom's Hues",
        "description": "Physical DMG increases by 20.0% against MECH enemies. Crystalline Seed explosions deal 15.0% bonus Physical DMG."
      },
      {
        "name": "Seedling's Vitality",
        "description": "Every Crystalline Seed on enemies causes them to take 3.0% bonus Physical DMG from Miss Pink Elf♪ (independent effect). Enemies with 4 Crystalline Seeds additionally take 4.0% bonus Physical DMG from Miss Pink Elf♪ (independent effect).",
        "requiredRank": "s2"
      },
      {
        "name": "QTE: Crane's Dance",
        "description": "Triggered by Time-Slowed enemies. Perform a devastating strike in midair, dealing 1000.0% ATK of Physical DMG, and attach 4 Crystalline Seeds to enemies hit."
      }
    ]
  }
}