{
  "id": "sd",
  "name": "Shadow Dash",
  "type": "mecha",
  "valkyrie": "mei",
  "strengths": [
    "physical",
    "fast atk"
  ],
  "leader": {
    "core": {
      "name": "Phantom Outbreak",
      "description": "Leader Bonus:\nPhantom Outbreak: Characters of the team gain 15% Crit Rate when whole above 80% HP."
    },
    "subskills": [
      {
        "name": "Phantom Outbreak",
        "description": "Characters in the team gain 21% Crit Rate when HP is higher than 80%.",
        "requiredRank": "s"
      }
    ]
  },
  "special": {
    "core": {
      "name": "Combo Skill: Speed Fatale",
      "description": "Dashes to enemy and knocks it airborne.\nCharging Cut: 180% ATK of Physical DMG and knocks enemies airborne."
    },
    "subskills": [
      {
        "name": "Switch: Shadowless Blade",
        "description": "Switch entry unleashes an upward slash, dealing 180% ATK of Physical DMG, and deals an additional 250%x2 ATK of Physical DMG to enemies knocked airborne."
      },
      {
        "name": "QTE: Shadow Blade",
        "description": "Triggers QTE when enemy is stunned, dealing 220% + 4xX% ATK of Physical DMG."
      },
      {
        "name": "Crescent Spin",
        "description": "Unleashes a sweeping strike when tapping the [ATK] button after triggering combo and switch attacks, dealing 70% ATK x4 of AOE Physical DMG."
      }
    ]
  },
  "passive": {
    "core": {
      "name": "Passive Skill",
      "description": "Character receives boost from passive skills automatically."
    },
    "subskills": [
      {
        "name": "Backstab",
        "description": "Gain 60% Total DMG Multiplier when attacking an enemy from the side or from behind."
      },
      {
        "name": "Shadow Aura",
        "description": "Increases physical and elemental damage done to stunned, paralyzed, and enemies slowed by Time Slow by 30.0%.",
        "requiredRank": "s"
      },
      {
        "name": "Ultimate Energy",
        "description": "Gain X Max SP in battle. Tsukuyomi costs 10 more SP, but number of ultimate illusions generated is increased to 3 (must unlock Shadow Army first).",
        "requiredRank": "sss"
      }
    ]
  },
  "ultimate": {
    "core": {
      "name": "Tsukuyomi",
      "description": "Summons an Ultimate Illusion to fight for you.\nThe Illusion specs: 50% of the character HP, 100% of character ATK and CRT, and immunity to Physical DMG; loses 10% of its max HP per second.\nSP Cost: 75"
    },
    "subskills": [
      {
        "name": "Sakura Shuriken",
        "description": "Ultimate illusion explodes when it disappears, dealing 3.0xATK of Physical DMG to nearby enemies and paralyzing them for 3.0s."
      },
      {
        "name": "Shadow Mantra",
        "description": "Increases max HP of ultimate illusion to 80.0% of the character's max HP. Decreases HP consumption per second to 7.0% of the max HP."
      },
      {
        "name": "Shadow Army",
        "description": "Increases the number of ultimate illusions to 2 but decreases their ATK to 50% of the character's ATK.",
        "requiredRank": "ss"
      }
    ]
  },
  "evasion": {
    "core": {
      "name": "Untouchable",
      "description": "Quick dash to evade enemy attacks.\nBody Clone: Triggers upon an Ultimate Evasion, summoning an illusion to fight. Illusion has 25% of the character's ATK and lasts 5s. CD: 10s. Only 1 illusion can exist at a time."
    },
    "subskills": [
      {
        "name": "Keen Edge",
        "description": "Tap the [ATK] button after evasion to unleash Speed Fatale. Speed Fatale gains 70% for 1.5s upon evasion. CD: 4.0s."
      },
      {
        "name": "Ghost Image",
        "description": "Illusion generated by successful evasion has ATK equal to 60% of character's ATK. Duration extended to 7.0s."
      },
      {
        "name": "Shadow Razor",
        "description": "Ultimate Evasion effects can be triggered X more time (s). CD is decreased by Xs.",
        "requiredRank": "s"
      }
    ]
  },
  "basic": {
    "core": {
      "name": "Gokiketsu",
      "description": "AOE penta-slash.\n1st Sequence: 80% ATK of Physical DMG.\n2nd Sequence: 80% ATK of Physical DMG.\n3rd Sequence: 100% ATK of Physical DMG.\n4th Sequence: 100% ATK of Physical DMG.\n5th Sequence: 250% ATK of AOE Physical DMG."
    },
    "subskills": [
      {
        "name": "Endless Aura",
        "description": "Significantly extends sword ki range of basic attacks. Each hit of Basic ATKs or Combo ATKs deals 120 more Physical DMG.",
        "requiredRank": "this"
      },
      {
        "name": "Mind Aura",
        "description": "Increases Crit DMG of basic and combo attacks by 40.0%.",
        "requiredRank": "ss"
      }
    ]
  }
}