{
  "id": "sk",
  "version": "2.3",
  "name": "Shadow Knight",
  "type": "mecha",
  "valkyrie": "fuhua",
  "strengths": ["lightning dmg", "burst", "time mastery", "fast atk", "bleed"],
  "leader": {
    "core": {
      "name": "Lethal Arts",
      "description": "Leader Bonus:\nCalamity: Team gains 24% Elemental DMG. Non-Kiana, Mei, or Bronya characters get an additional 30 SP upon switch entry."
    },
    "subskills": [
      {
        "name": "Calamity",
        "description": "Team gains 28% Elemental DMG. Non-Kiana, Mei, or Bronya characters receive 50 initial SP in battle. In Open World, the initial SP bonus effect triggers once every 10 min.",
        "requiredRank": "ss"
      }
    ]
  },
  "special": {
    "core": {
      "name": "Combo: Shadow Dragon",
      "description": "Link Six Fists stances into Combo ATKs.\nKi Riptide: 140%+180% ATK of Physical DMG.\nKi Pulverize: 200%+220% ATK of Physical DMG.\nKi Seismic Slam: 100% ATK of Physical DMG.\nShi-Ki Crescent: 180% ATK of Physical DMG if not fully charged or if SP is too low to enter Eclipse Mode."
    },
    "subskills": [
      {
        "name": "Gale",
        "description": "Ki Seismic Slam and Shi-Ki Crescent can knock back enemies. Enemies knocked against the wall are stunned for 2s (CD: 4s) and will bleed for 6.0s, taking 180 Physical DMG every 0.5s."
      },
      {
        "name": "Switch: Desolation",
        "description": "Unlocks Switch Skill. Unleash a ground smash in switch entry to deal 300.0% ATK of Lightning DMG."
      },
      {
        "name": "QTE: Annihilation",
        "description": "QTE: Triggers when an enemy is frozen, dealing 400.0% ATK of Lightning DMG against enemies within a large AOE; additionally deals 300.0% ATK of Lightning DMG against the frozen enemy and other enemies nearby."
      }
    ]
  },
  "passive": {
    "core": {
      "name": "Passive",
      "description": "Passive bonuses apply automatically."
    },
    "subskills": [
      {
        "name": "Anguish",
        "description": "Under Eclipse Mode, there is a 20.0% chance to discharge electricity every second, paralyzing enemies within a 3.5-meter radius for 2.0s.",
        "requiredRank": "sss"
      },
      {
        "name": "Empty Heart",
        "description": "Deals 50.0% more Total DMG against slowed or bleeding enemies."
      },
      {
        "name": "Despair",
        "description": "For 10.0s before Eclipse Mode, gains 15.0% ATK Speed. When last hit of Shi-Ki Onslaught or Shi-Ki Charged Palm strikes the enemy, gains Iron Body and 60.0% Total DMG Reduction for DMG received for 2.5s.",
        "requiredRank": "ss"
      }
    ]
  },
  "ultimate": {
    "core": {
      "name": "Raging Tiger",
      "description": "At over 60 SP, casting Shi-Ki Crescent procs Lunar Eclipse mode that lasts up to 60s, spending 6 SP/s and -100% attack SP recovery, but deals +40% lightning DMG.\nWhen Eclipse ends, recover 30% of initial SP when casting the skill.\nBurst: Enters Lunar Eclipse (burst mode) and launches Shi-Ki Crescent dealing  480% ATK of Physical DMG.\nLunar Eclipse attacks:\nSix Fists: total of 860% ATK of Physical DMG.\nShi-Ki Charged Palm: 180% + 240% ATK of Physical DMG.\nShi-Ki Onslaught: 260% + 5x50% per combo hit + 340% ATK of Physical DMG.\nShi-Ki Crescent: 320% ATK of Physical DMG."
    },
    "subskills": [
      {
        "name": "Yin",
        "description": "Take 40% less Indirect Physical DMG (e.g. DMG caused by bleeding). In Eclipse Mode, gains 25% Total DMG Reduction for DMG taken; during the Shi-Ki Onslaught hit barrage, gain another 25% Total DMG Reduction. In Eclipse Mode, each Shi-Ki Onslaught hit additionally deals 80.0% ATK of Lightning DMG and slowly pulls enemies closer."
      },
      {
        "name": "Moon",
        "description": "In Eclipse Mode, when Shi-Ki Crescent hits the ground, inflict Time Lock for 4s and bleeds the target, dealing 180 Physical DMG every 0.5s for 12.0s.",
        "requiredRank": "ss"
      },
      {
        "name": "Umbra",
        "description": "Eclipse Mode: Shi-Ki Crescent impacts generates a 6m-radius Lightning Field that lasts 20.0s, within which enemies take 200.0 Lightning DMG every 0.5s, while Valkyrie gains 5.0% Lightning DMG per second (max stacks: 10), and starts to lose Lightning DMG at the same rate after leaving the AOE for 3s. Only 1 Lightning Field can exist. Cast Shi-Ki Crescent in Eclipse Mode again to change the location of the Lightning Field."
      }
    ]
  },
  "evasion": {
    "core": {
      "name": "Dark Sparrow",
      "description": "Rapid evasive maneuver. Can be performed twice in a row.\nNot in Eclipse Mode: Within a  short duration after Ultimate Evasion, tap the Combo ATK button to dash to the enemy and unleash Ki Riptide.\nEclipse Mode: Within a short duration after Ultimate Evasion, tap the Combo ATK button to unleash Shi-Ki Onslaught.\nElectrical Surge: Triggering an Ultimate Evasion deals 250% ATK of Lightning DMG against enemies within a large AOE; CD: 15s."
    },
    "subskills": [
      {
        "name": "Cinders",
        "description": "Shortens CD of Ultimate Evasion by 3.0s."
      },
      {
        "name": "Chaos",
        "description": "After Ultimate Evasion, Electrical Surge additionally deals 180.0% ATK of Lightning DMG. For each enemy damaged by the surge, the Valkyrie gains 2.0 SP and bleeds the enemies target to further deal 180 Physical DMG per second for 8s."
      }
    ]
  },
  "basic": {
    "core": {
      "name": "Wasteland Panther",
      "description": "Use The Six Fists for battle.\nThe Six Fists:\n1st Stance: 90% ATK of Physical DMG.\n2nd Stance: 90% ATK of Physical DMG.\n3rd Stance: 90% ATK of Physical DMG.\n4th Stance: 2x60% ATK of Physical DMG.\n5th Stance: 2x80% ATK of Physical DMG.\n6th Stance: 180% ATK of Physical DMG."
    },
    "subskills": [
      {
        "name": "Ferocity",
        "description": "Every hit of Six Fists additionally deals 50.0% ATK of Lightning DMG. In Eclipse Mode, every hit of Six Fists further deals another 50.0% ATK of Lightning DMG."
      },
      {
        "name": "New Moon",
        "description": "After the last hit of Ki Riptide, the last 2 hits of Shi-Ki Charged Palm, or for 18s after Shi-Ki Crescent activates Eclipse Mode, every 3rd attack deals 300.0% ATK of Lightning DMG in a 3-meter radius. When not in Eclipse Mode, each AOE Lightning DMG dealt recovers 3.0 SP."
      },
      {
        "name": "Vehemence",
        "description": "When Ki Pulverize or Shi-Ki Onslaught hits, temporarily imprison the target and gain a 100.0% chance to make the target take 600 Lightning DMG every second for 5s."
      }
    ]
  }
}
