{
  "id": "aka",
  "version": "2.9",
  "name": "Argent Knight: Artemis",
  "type": "biologic",
  "valkyrie": "rita",
  "features": ["ice-dmg", "burst", "freeze"],
  "equipment": [
    {
      "type": "recommended",
      "weapon": "skadi-of-thrymheim",
      "stigmataTop": "ana-schariac-top",
      "stigmataMid": "ana-schariac-mid",
      "stigmataBot": "ana-schariac-bot"
    }
  ],
  "leader": {
    "core": {
      "name": "Herald of Dawn",
      "description": "Leader Bonus:\nSetting Moon: Team gains 10% Total DMG Multiplier to Charged or Combo ATKs. For teams with characters of 3 different types, attacks gain 12% Elemental DMG."
    },
    "subskills": [
      {
        "name": "Crescent Blade",
        "description": "In burst mode, Valkyrie's Attack Speed increases by 15%.",
        "requiredRank": "ss1"
      },
      {
        "name": "Herald of Dawn",
        "description": "Team gains 16% Total DMG Multiplier to Charged or Combo ATKs. For teams with characters of 3 different types, attacks gain 18% Elemental DMG.",
        "requiredRank": "s3"
      },
      {
        "name": "Jade Moon",
        "description": "Crescent Shadow's summoning cooldown is reduced to 6.0s.",
        "requiredRank": "ss2"
      }
    ]
  },
  "special": {
    "core": {
      "name": "Charge: Frost Beam",
      "description": "Tap and hold the [ATK] button during the 5-sequence Basic ATK to remove 2 stacks of Hypothermia to deal massive DMG.\nHold [ATK] button during any sequence of Basic ATK to unleash Charged ATK, which deals 100% ATK of AOE Ice DMG, removes 2 stacks (if any) of Hypothermia, seals enemies in Ice Cell, and deals 4x100% ATK of Ice DMG. Enemies will be frozen in Ice Cell.\nNormal mode: Each Charged ATK recovers 3 SP upon removing 2 stacks of Hypothermia.\nBurst mode: Charged ATK shuttles through enemies, deals 2x150% ATK of Ice DMG, and summons Crescent Harvest (summoned entity), which deals 5x125% ATK of Ice DMG with a spinning scythe in the position of the 1st enemy hit.\nSwitch: Enhanced 3rd sequence of Basic ATK dealin 80%+160% ATK of Physical DMG."
    },
    "subskills": [
      {
        "name": "Argent Scythe",
        "description": "Charged ATK consumes 2 stacks of Hypothermia to deal multi-stage DMG. Each stage gains 120.0% ATK of Ice DMG."
      },
      {
        "name": "QTE: Sudden Frost",
        "description": "QTE: Triggered when paralyzing or freezing the enemy, dealing 100% + 150% + 300.0% ATK of Physical DMG. Crescent Harvest deals 3x50% + 400.0% ATK of Ice DMG and applies 1 stack of Hypothermia."
      },
      {
        "name": "Glacial Armor",
        "description": "When Charged ATK consumes 2 stacks of Hypothermia, gain Glacial Armor that gives a 50% Total DMG Reduction buff for 7.00s."
      }
    ]
  },
  "passive": {
    "core": {
      "name": "Hypothermia",
      "description": "Passive bonuses apply automatically.\nHypothermia: When Crescent Harvest is present, hits from certain skills apply Hypothermia (2 stacks max) to enemies.\n1 stack of Hypothermia: Reduce enemy Ignore Interrupt for 10s and inflict minor Rime Trauma; 2 stack of Hypothermia: Reduce enemy Ignore Interrupt & Interrupt, slows their Attack and Move speed by 20% for 6s, and inflict minor Rime Trauma.\nInflicting Hypothermia on enemies with 2 stacks will refresh the duration. Hypothermia does not work on enemies in Ice Cell."
    },
    "subskills": [
      {
        "name": "Diamond Dust",
        "description": "Gains 50.0% or 80.0% Ice DMG against enemies with Hypothermia or Ice Cell respectively."
      },
      {
        "name": "Robust Frigidity",
        "description": "Gains 15.0% Total DMG at above 33% and another 15.0% at above 66% HP."
      },
      {
        "name": "Frost Prison",
        "description": "Enemies trapped in Ice Cell take 24.0% bonus Total DMG (independent effect)."
      }
    ]
  },
  "ultimate": {
    "core": {
      "name": "Rave of Artemis",
      "description": "Enters Burst mode: Gains Glacial Armor, Ignore Interrupt, and 60% Total DMG Reduction. Basic ATKs (BATK) gain Ice DMG, and the last hit of each BATK sequence turns Hypothermia Stack 2 into Ice Cell; Crescent Harvest (summoned entity) assists Rita during BATK and inflicts Hypothermia with ATK sequences 2 and 4.\nLunar Burst: During Burst, spend 10 SP to cast Ultimate again to end Burst mode, deal 400% ATK of large AOE Ice DMG, and inflict Ice Cell for 3s (2s for Bosses); enemies freeze for 5s and return to Hypothermia Stack 2 after that. CD: 6s. Min activation SP: 80. SP consumption: 0-8s: 7 SP/s; 8-16s: 10 SP/s; after 16s: 15 SP/s. Max duration: 24s."
    },
    "subskills": [
      {
        "name": "Waxing Moon",
        "description": "Performing the Ultimate heals the character for 600.0 HP."
      },
      {
        "name": "Frost Cells",
        "description": "Lunar Burst deals another 300.0% ATK of Ice DMG. Extends Ice Cell duration by 1.50s (duration against elites or bosses is extended by 1.00s).",
        "requiredRank": "sss"
      },
      {
        "name": "Winter Harvest",
        "description": "Burst: 5-sequence Basic ATK and Charged ATK of character / Crescent Harvest gain 60.0%/80.0% Ice DMG (including the multi-stage DMG inflicted by consuming 2 stacks of Hypothermia)."
      }
    ]
  },
  "evasion": {
    "core": {
      "name": "Phantom Dance",
      "description": "Quickly evades enemy attack. Can be performed twice in a row.\nImmediately launch the 4th sequence of Basic ATK after Ultimate Evasion.\nPhantom Dance: Summons Crescent Harvest (summoned entity) on the attacker upon Ultimate Evasion, dealing 6x80% ATK of AOE Ice DMG and inflicting Hypothermia; CD: 20s."
    },
    "subskills": [
      {
        "name": "Uranian Mirror",
        "description": "Shortens CD of Phantom Dance by 3.0s.",
        "requiredRank": "s1"
      },
      {
        "name": "Waning Crescent",
        "description": "Crescent Harvest summoned by Phantom Dance gain 50.0% ATK of Ice DMG for every ATK sequence."
      },
      {
        "name": "Rimy World",
        "description": "Each Charged ATK boosts Crescent Harvest's Ice DMG by 30.0% for 3s.",
        "requiredRank": "s2"
      }
    ]
  },
  "basic": {
    "core": {
      "name": "Cold Moon",
      "description": "5-sequence scythe attack.\n1st Sequence: 80% ATK of Physical DMG.\n2nd Sequence: 40% + 100% ATK of Physical DMG.\n3rd Sequence: 40% + 100% ATK of Physical DMG.\n4th Sequence: 2x60% + 160% ATK of Physical DMG; pulls in enemies within a small AOE.\n5th Sequence: 150% + 250% ATK of Physical DMG, summons Crescent Harvest (summoned entity) to unleash a hit dealing 150% ATK of Ice DMG.\nDuring the 5-sequence Basic ATK, tap the [ATK] immediately after Evasion to continue the sequence."
    },
    "subskills": [
      {
        "name": "Frost Scythe",
        "description": "Each strike of the 5-sequence Basic ATK gains 50.0% ATK of Ice DMG."
      },
      {
        "name": "Crimson Astarte",
        "description": "Hitting enemies not affected by Ice Cell or 2 stacks of Hypothermia with first 4 sequences of Basic ATK summons Crescent Harvest at the enemy's location, striking 1 time to deal 450.0% ATK of AOE Ice DMG and inflict Hypothermia. Summon CD: 6.00s."
      },
      {
        "name": "Crescent Shadow",
        "description": "When team mates hit enemies with Charged or Combo ATKs, summon Crescent Harvest at the enemy's location, striking 1 time to deal 300.0% ATK of AOE Ice DMG and apply Hypothermia. Summon CD: 12.00s. CD is counted separately from each team mate."
      }
    ]
  }
}
