{
  "id": "aponia",
  "version": "5.7",
  "name": "Disciplinary Perdition",
  "type": "biologic",
  "valkyrie": "aponia",
  "features": ["lightning-dmg", "time mastery", "aerial"],
  "equipment": [
    {
      "type": "recommended",
      "weapon": "lost-conviction-damnation",
      "stigmataTop": "zeno-top",
      "stigmataMid": "zeno-mid",
      "stigmataBot": "zeno-bot"
    }
  ],
  "leader": {
    "core": {
      "name": "Discipline, Undefiable",
      "description": "Leader Bonus\nLeader Skill: Increases the team's ranged Lightning DMG by 40.0% and the team's Total DMG by 20.0%."
    },
    "subskills": [
      {
        "name": "This Discipline, Indispensable",
        "description": "Increases the team's ranged Lightning DMG by 40.0% and the team's Total DMG by 20.0%."
      }
    ]
  },
  "special": {
    "core": {
      "name": "Combo ATK: Good and Evil, Absolute",
      "description": "In Conviction, teammates on the field deal Disciplinary Perdition's DMG.\nIn Conviction, she prays for the Valkyries on the field, allowing Lightning DMG dealers to deal 135% Disciplinary Perdition's ATK of bonus Lightning DMG to all enemies (CD: 0.4s).\nAt full Redemption, hold [ATK] to enter Predictor's Sentence, which reduces incoming Total DMG by 80% and summons Thunderstorms dealing 16 x 125% ATK of Lightning DMG in total to surrounding enemies. When Redemption falls to 0, she unleashes Inhibitor's Adjudication that deals 1850% ATK of Lightning DMG to all enemies and cancels Predictor's Sentence."
    },
    "subskills": [
      {
        "name": "Insolence is Forbidden",
        "description": "Increases Combo ATK's Total DMG by 15.0%. In Conviction, every triggerd Combo ATK restores 10.0 Redemption."
      },
      {
        "name": "Imprudence is Forbidden",
        "description": "Increases Combo ATK's Lightning DMG by 15.0%. In Conviction, every landed Combo ATK restores 0.20 SP."
      },
      {
        "name": "Avarice is Forbidden",
        "description": "Inhibitor's Adjudication deals 300.0% ATK of bonus Lightning DMG and restores 5.0 SP.",
        "requiredRank": "s2"
      }
    ]
  },
  "passive": {
    "core": {
      "name": "This Life, Ascetic",
      "description": "Passive bonuses apply automatically.\nRedemption, which caps at 200, can be recovered in many ways.\nBasic ATK SEQ 3/4 restores 10/25 Redemption on hit.\nBy wielding the chakram as a ring, she has acquired the weapon active This Mind, Untainted.\nWithout full Redemption, using weapon active sends her into Conviction.\nIn Conviction, she recovers 5 Redemption(max: 200) per second, becomes invincible but unable to move or evade, and will stay on the field until charging is complete if switched out.\nOnce Redemption reaches 200, she exits Conviction, and leaves and resets her switch CD if she is still on the field."
    },
    "subskills": [
      {
        "name": "I Shall Correct Paths",
        "description": "Entering perdictor's Sentence increases Total DMG by 30.0% for 9.0s."
      },
      {
        "name": "I Shall Achieve Illumination",
        "description": "Increases Inhibitor's Adjudication's Lightning DMG by 45.0%. Exiting Predictor's Sentence restores 15.0 SP.",
        "requiredRank": "ss"
      },
      {
        "name": "I Shall Avert Ruination",
        "description": "Triggering Ultimate Evasion Skill makes enemies take 20.0% bonus Lightning DMG from her (cannot stack) for 12.0s."
      }
    ]
  },
  "ultimate": {
    "core": {
      "name": "This Sin, Inexorable",
      "description": "Aponia rises into the sky and delivers punishment to all enemies.\nRain down destruction from above, dealing 14 x 180% + 1280% ATK of Lightning DMG to all enemies, during which all skill timers and the stage timer are paused.\nSP cost: 100. CD: 20s."
    },
    "subskills": [
      {
        "name": "Its Sin, Irredeemable",
        "description": "Exiting Predictor's Sentence increases Ultimate's Total DMG by 35.0% for 4.0s."
      },
      {
        "name": "Its Sin, Unforgivable",
        "description": "In Conviction, Good and Evil, Absolute triggered by teammates on the field deals 15.0% ATK of bonus Lightning DMG.",
        "requiredRank": "sss"
      },
      {
        "name": "Its Sin Deserves Excommunication",
        "description": "Using Ultimate increases Basic ATK's and Combo ATK's Total DMG by 20.0% and reduces incoming Total DMG by 30.0% for 12.0s."
      }
    ]
  },
  "evasion": {
    "core": {
      "name": "This Soma, Reincarnated",
      "description": "Quickly dodge enemy attacks. Can be performed twice in a row.\nUltimate Evasion Skill: Causes a 2.5s Global Time Fracture, unleashes Summoner's Promise that deals 3 x 300% ATK of Lightning DMG to all enemies, and restores 100 HP to the team. CD: 15s."
    },
    "subskills": [
      {
        "name": "To See Strings Detach",
        "description": "If an enemy is paralyzed, restores 40.0 Redemption and triggers Ultimate Evasion Skill (effective if controlling another Valkyrie). The ensuing Summoner's Promise deals 50.0% more Lightning DMG."
      },
      {
        "name": "To See Suffering Cycle",
        "description": "Increases Summoner's Promise's Total DMG by 30.0% and reduces its CD by 4.0s."
      },
      {
        "name": "To See Ending Decay",
        "description": "Entering Conviction or Predictor's Sentence triggers Ultimate Evasion Skill."
      }
    ]
  },
  "basic": {
    "core": {
      "name": "Love and Hate, Discerned",
      "description": "Using the chakram as a ring to purge enemies.\nBasic ATK:\nSEQ 1: Deals 3 x 65% ATK of Lightning DMG.\nSEQ 2: Deals 6 x 25% ATK of Lightning DMG.\nSEQ 3: Deals 65% + 80% ATK of Lightning DMG.\nSEQ4: Deals 250% ATK of Lightning DMG.\nIn Conviction, hold [ATK] to call down lightning dealing 100% ATK of Lightning DMG. It is registered as Combo ATK and has a 0.35s CD."
    },
    "subskills": [
      {
        "name": "Cleansed Henceforth",
        "description": "Restoring Redemption increases Total DMG by 20.0% for 10.0s (triggering it again refreshes the duration)."
      },
      {
        "name": "QTE: Sinful Henceforth",
        "description": "QTE: Triggered when an enemy is Time-Slowed or paralyzed. Causes a 3s Global Time Fracture, deals 3 x 100% + 4 x 150% + 900.0% ATK of Lightning DMG to all enemies, and restores 6.0 SP."
      }
    ]
  }
}
