{
  "id": "bke",
  "version": "3.9",
  "name": "Bright Knight: Excelsis",
  "type": "mecha",
  "valkyrie": "durandal",
  "features": ["physical", "burst", "time mastery", "heavy-atk"],
  "equipment": [
    {
      "type": "recommended",
      "weapon": "abyss-flower-liminal-spiral",
      "stigmataTop": "dante-top",
      "stigmataMid": "dante-mid",
      "stigmataBot": "dante-bot"
    }
  ],
  "leader": {
    "core": {
      "name": "Horns of Jericho",
      "description": "Leader Bonus:\nGrants 20.0% bonus Physical DMG and 20.0% bonus Crit DMG to the team."
    },
    "subskills": [
      {
        "name": "When the Flag Flutters",
        "description": "Ultimate Evasion restores 6 SP and boosts Crit Rate by 10.0% for 8s.",
        "requiredRank": "s2"
      },
      {
        "name": "Horns of Jericho",
        "description": "Team deals 25.0% bonus Physical DMG and 25.0% bonus Crit DMG.",
        "requiredRank": "s3"
      },
      {
        "name": "When the Stars Sparkle",
        "description": "Every Retaliation grants 1 bonus Paragon stack.",
        "requiredRank": "ss2"
      }
    ]
  },
  "special": {
    "core": {
      "name": "Kontos Equites",
      "description": "Tap or hold [ATK] after certain moves to perform Charged ATKs.\nHold [ATK] during the 5th sequence of Basic ATK or tap [ATK] after a successful Retaliation to perform Javelin or Javelin EX.\nJavelin deals 4x100% ATK of Physical DMG.\nJavelin EX deals 4x260% ATK of Physical DMG and pulls in enemies around the lance's landing point for 3s.The 4th sequence of Basic ATK can be performed right after Javelin or Javelin EX.\nIn Burst mode, tap [ATK] upon a successful Retaliation to perform Phantom Blade or Phantom Cleave. Phantom Blade deals 650% ATK of Physical DMG. Phantom Cleave immediately pulls in all nearby enemies and then deals a total of 1550% ATK of Physical DMG.\nJavelin EX and Phantom Cleave are triggered by Focus EX."
    },
    "subskills": [
      {
        "name": "Knightly Phalanx",
        "description": "Javelin and Javelin EX deal 20.0% more DMG against shields. Each hit of Javelin / Javelin EX additionally restores 1.4/2.0 SP respectively."
      },
      {
        "name": "Hallowed Oberhau",
        "description": "Phantom Cleave deals 150.0% ATK of bonus Physical DMG."
      }
    ]
  },
  "passive": {
    "core": {
      "name": "Passive Skill",
      "description": "Passive bonuses apply automaticallyParagon: Durandal stacks Paragon when taking damage, and every stack empowers her. 10 stacks max."
    },
    "subskills": [
      {
        "name": "Castling",
        "description": "Every Paragon stack grants Durandal 3.0% total DMG reduction."
      },
      {
        "name": "Checkmate",
        "description": "At 10 Paragon stacks, self total DMG is boosted by 20.0%."
      },
      {
        "name": "Queen's Promotion",
        "description": "Every hit taken grants Durandal a Paragon stack which boosts self total DMG by 4.0% for 40s (10 stacks max). Retaliation grants 2 bonus stacks."
      }
    ]
  },
  "ultimate": {
    "core": {
      "name": "Sceptum Regalis",
      "description": "Enter Burst mode and unlock the true potential of Bright Knight: Excelsis.\n1st sequence: 150% ATK of Physical DMG.\n2nd sequence: 180% + 200% ATK of Physical DMG.\n3rd sequence: 280% ATK of Physical DMG.\n4th sequence: 6 x 70% ATK of Physical DMG.\n5th sequence: 450% ATK of Physical DMG.\nEvade forward to deal 100% ATK of Physical DMG and enter Turbojet state, enabling Turbojet Assault, which deals 200% + 250% ATK of Physical DMG. The 3rd sequence of Basic ATK can be performed right after Turbojet Assault.\nWhen Focus EX in not in cooldown, hit an enemy upon entering Turbojet (forward evasion) to trigger Focus EX.\nBurst mode lasts 23s and costs 100SP to activate, during which Durandal gains Iron Body. CD: 25s.Switching out will end Burst mode."
    },
    "subskills": [
      {
        "name": "Benoni's Breaker",
        "description": "In Burst mode, the Valkyrie deals 20.0% more DMG against shields and 30.0% more Physical DMG against shieldless enemies."
      },
      {
        "name": "Caro-Kann Bulwark",
        "description": "The ending of Burst mode recovers 15 SP.",
        "requiredRank": "sss"
      },
      {
        "name": "Knight's Tour",
        "description": "In Burst mode, Total DMG is boosted by 50.0%."
      }
    ]
  },
  "evasion": {
    "core": {
      "name": "Scutum Divinitas",
      "description": "Durandal adopts defense posture to block incoming attacks and retaliate.\nTap [Evade] (non-directional) for Defense, during which incoming attacks trigger Retaliation, nullifying the attacks and returning 50% ATK of Physical DMG.\nRetaliation and Ultimate Evasion can both trigger Focus EX.\nFocus EX triggers brief Time Slow and enables Javelin EX or Phantom Cleave. CD: 10s. Minimum CD: 8s."
    },
    "subskills": [
      {
        "name": "Giuoco's Serenity",
        "description": "Retaliation recovers 10.0% of max HP and grants 50.0% of bonus Physical DMG plus 30.0% total DMG reduction to self for 8s."
      },
      {
        "name": "Evans Assault",
        "description": "Enemies hit by Retaliation are inflicted with Physical Vulnerability and take 10.0% bonus Physical DMG for 10s.",
        "requiredRank": "ss"
      }
    ]
  },
  "basic": {
    "core": {
      "name": "Gladius Milites",
      "description": "Lance attacks.\n1st Sequence: 100% ATK of Physical DMG.\n2nd Sequence: 120% ATK of Physical DMG.\n3rd Sequence: 200% ATK of Physical DMG.\n4th Sequence: 4x100%% ATK of Physical DMG.\n5th Sequence: 150%+250% ATK of Physical DMG."
    },
    "subskills": [
      {
        "name": "Seize the Center",
        "description": "When not in Burst mode, 4th and 5th sequences grant Ignore Interrupt and 30.0% total DMG reduction."
      },
      {
        "name": "King's Gambit",
        "description": "When not in Burst mode, every hit of 4th sequence of Basic ATK recovers 1.7 bonus SP."
      },
      {
        "name": "QTE - Falkbeer's Counter",
        "description": "QTE: Triggered when an enemy is Time-Slowed to deal 5 x 40% + 800% ATK of Physical DMG and grants 2 stacks of Paragon."
      }
    ]
  }
}
