{
  "id": "br",
  "name": "Blood Rose",
  "type": "psychic",
  "valkyrie": "himeko",
  "features": ["fire-dmg", "burst", "heavy-atk", "ignite"],
  "leader": {
    "core": {
      "name": "Blood Waltz",
      "description": "Leader Bonus:\nBlood Waltz: All team members' Charged ATKs deal 18% more Total DMG. If the team consists of members of 3 different types, all team members gain 15% Total DMG."
    },
    "subskills": [
      {
        "name": "Blood Waltz",
        "description": "Charged ATKs of the team gain 18% Total DMG Multiplier. For teams with characters of different types, attacks gain 15% Total DMG Multiplier."
      }
    ]
  },
  "special": {
    "core": {
      "name": "Blood Pirouette",
      "description": "During evasion, unleash a horizontal sweep attack at the enemy.\nRiposte: Tap the [ATK] button while evading to unleash a spinning slash, dealing 200.0% ATK of Physical DMG. CD: 5s.\nIf the spinning slash hits the enemy, gain 5 SP to self.\nAfter spinning slash, tap the [ATK] button when the flashing circle appears on the character to directly unleash a charged attack.\nSprint ATK: Tap the [ATK] button while sprinting to unleash a large AOE horizontal sweep that deals 400.0% ATK of Physical DMG."
    },
    "subskills": [
      {
        "name": "Switch: Downward Step",
        "description": "Switch entry unleashes a Windmill Cleave, dealing 400%+50% ATK of Physical DMG."
      },
      {
        "name": "Igniting Axel",
        "description": "Riposte has a 75.0% chance to ignite the enemy for 4s, dealing 160 Fire DMG every 0.5s."
      },
      {
        "name": "QTE: Burning Windmills",
        "description": "QTE: Triggers when enemy is stunned. Unleashes a powerful Windmill Cleave, dealing 250%+301% ATK of Physical DMG and generating a flame burst that deals 115% AOE Fire DMG."
      }
    ]
  },
  "passive": {
    "core": {
      "name": "Passive",
      "description": "Passive bonuses apply automatically."
    },
    "subskills": [
      {
        "name": "Burning Blood",
        "description": "Basic ATKs or Blood Wrath ATK against ignited enemies additionally deals 160.0% ATK of Fire DMG."
      },
      {
        "name": "Warding Blood",
        "description": "When HP is below 66%, gain 30.0% Total DMG Multiplier, take 35.0% less Physical DMG, and increase Ignore Interrupt."
      },
      {
        "name": "Purifying Blood",
        "description": "When HP is below 50%, take 67% less elemental DMG, shorten the durations of most debuffs, and extends the duration of ignite by 50%.",
        "requiredRank": "sss"
      }
    ]
  },
  "ultimate": {
    "core": {
      "name": "Blood Wrath",
      "description": "Activates burst mode: Blood Wrath which costs an increasing percentage of HP per second to maintain. Tap [ULT] again or switch out to end burst mode.\nVehement Flame: Consumes 30 SP to enter burst mode. Tap the [ATK] button to unleash Charged ATKs.\n1st Sequence: 340% ATK of Physical + 310% ATK of Fire DMG;\n2nd Sequence: 260% ATK of Physical + 240% ATK of Fire DMG;\n3rd Sequence: 300% ATK of Physical + 250% ATK of Fire DMG; mid-air slash: 2x100% ATK of Physical DMG + 2x180% ATK of Fire DMG; Last Hit: (380%+50%) ATK of Physical DMG + (320%+50%) ATK of Fire DMG.\nCost: 30 SP to activate. Deals 200% ATK of AOE Fire DMG and ignites enemies for 6s.\nBlood Philter: Blood Rose gains 40% Total DMG Reduction and immunity to stun, paralyze, and freeze."
    },
    "subskills": [
      {
        "name": "Blood Boost",
        "description": "Increases Attack Speed by 50.0% and Move Speed by 25.0% when Blood Wrath is active."
      },
      {
        "name": "Blood Rondeau",
        "description": "During Blood Wrath, tap the [ATK] button during Windmill Cleave to increase the number of strikes up to 5 times. Each Windmill Cleave strike also deals an increased 80.0% ATK of Physical and Fire DMG."
      },
      {
        "name": "Blood Curse",
        "description": "When Blood Wrath is active and HP is below 50%, gain 30.0% Crit Rate and 30.0% Fire DMG.",
        "requiredRank": "ss"
      }
    ]
  },
  "evasion": {
    "core": {
      "name": "Blood Bravura",
      "description": "Sideways dodge to evade enemy attacks. Can be triggered 2 times in a row.\nCrimson Charge: Unleashes a Charged Combo instantly after Ultimate Evasion.\nMacropyre: Creates an explosion centered on the attacker, dealing 200% ATK of Fire DMG.\nCD: 15s."
    },
    "subskills": [
      {
        "name": "Blood Concerto",
        "description": "Shortens CD of Macropyre by 4.0s."
      },
      {
        "name": "Blood Aria",
        "description": "Generates a fire ring when Macropyre is triggered, dealing 127 Fire DMG every 0.3s. The fire ring lasts for 6.0s."
      },
      {
        "name": "Blood Serenade",
        "description": "Macropyre ignites enemy, dealing 233 Fire DMG every 0.5s for 4.0s.",
        "requiredRank": "ss"
      }
    ]
  },
  "basic": {
    "core": {
      "name": "Charge: Blooded Claymore",
      "description": "Basic ATK: Uncharged: 3-sequence Zweihänder Fechten. Charging unleashes an empowered ATK sequence.\nCharged ATK Sequence: The 3-sequence attack is followed by an aerial Windmill Cleave with increased Ignore Interrupt during the attack.\nBasic ATK: 150%+180%+220% ATK of Physical DMG\nCharged ATK: 250%+160%+200% ATK of Physical DMG\nWindmill Cleave: 140%+140%+400% ATK of Physical DMG"
    },
    "subskills": [
      {
        "name": "Burning Passion",
        "description": "Every hit from Basic or Charged ATK deals an additional 100.0% Fire DMG."
      },
      {
        "name": "Blood Symphony",
        "description": "Ignites the enemy attacker if attacked while performing Charged ATKs or during Blood Wrath, dealing 349 Fire DMG every 0.5s for 4s.",
        "requiredRank": "ss"
      },
      {
        "name": "Undying Rage",
        "description": "Upon ending Blood Wrath, recover 24.99% HP of the HP cost of the Ultimate.",
        "requiredRank": "ss"
      }
    ]
  }
}
