{
  "id": "db",
  "name": "Dimension Breaker",
  "type": "mecha",
  "valkyrie": "bronya",
  "features": ["physical", "burst", "time mastery", "bleed", "paralyze"],
  "leader": {
    "core": {
      "name": "Metal Gear",
      "description": "Leader Bonus:\nMetal Gear: Increases SP recovery by 25% for the team. Teams with 3 MECH-type characters gain 20% Total DMG Multiplier."
    },
    "subskills": [
      {
        "name": "Metal Gear",
        "description": "Accelerates Attack SP Recovery of team by 29%. Teams with 3 MECH-type characters gain 26% Total DMG Multiplier.",
        "requiredRank": "ss"
      },
      {
        "name": "Fusion",
        "description": "Increases own Crit DMG by 28.0% when Kiana and Mei are on the team."
      }
    ]
  },
  "special": {
    "core": {
      "name": "Switch: Dimension Pull",
      "description": "Switch skill immediately knocks target and all enemies in a small surrounding area airborne and inflicts Time Lock.\nDimensional Razor: 100% ATK of Physical DMG and inflicts Time Lock for 4s."
    },
    "subskills": [
      {
        "name": "Spacetime Cutter",
        "description": "When hitting an enemy affected by Time Slow, character attacks gain 80.0% Physical and Elemental DMG for 6s. Triggering this again resets the duration. Enemies affected by Time Lock of Dimension Pull will bleed and take 248 Physical DMG every 0.5s."
      },
      {
        "name": "Dimension Edge",
        "description": "Extends the range of Dimension Pull by 3.0 times and its duration by 3.0s."
      },
      {
        "name": "QTE: Complex Infinity",
        "description": "QTE: Triggered when enemy is paralyzed, dealing 10x70.0% ATK of Fire DMG to enemies in a large AOE. Knocks affected enemies airborne and inflicts Time Lock on them."
      }
    ]
  },
  "passive": {
    "core": {
      "name": "Passive Skill",
      "description": "Passive bonuses apply automatically.\nPlanes Walker: Become a Planes Walker after moving for 2s and significantly gains Move Speed."
    },
    "subskills": [
      {
        "name": "Dark Matter Furnace",
        "description": "When on standby, the Valkyrie restores 2 SP every 5.0s.",
        "requiredRank": "ss"
      }
    ]
  },
  "ultimate": {
    "core": {
      "name": "Project Bunny",
      "description": "Project Bunny activates autonomous attack protocols.\nMech Frenzy: Consumes 100 SP to enter a 10s Burst mode, during which Project Bunny (summoned entity) is invincible and draws enemies towards it.\nSurplus Energy: Turns own attacks into laser attacks.\nHeat Reset: Heat meters of laser-type weapons will be reset upon burst mode activation."
    },
    "subskills": [
      {
        "name": "Self Destruct",
        "description": "Project Bunny explodes at the end of the duration, dealing 600% ATK of AOE Physical DMG."
      },
      {
        "name": "Anti-Matter Core",
        "description": "When Project Bunny is unleashed, character laser attacks gain 20% Physical and Elemental DMG. For every point of SP above 110, further increase the DMG bonus by 0.6%. Stacks up to 200 times."
      },
      {
        "name": "S2 Cell",
        "description": "Extends the duration of Project Bunny's detachment to 16.0s.",
        "requiredRank": "ss"
      }
    ]
  },
  "evasion": {
    "core": {
      "name": "Dimension Reduction",
      "description": "Raises the shield to defend against frontal attacks.\nCounterstrike: Release the Defense button at the moment of the attack to unleash a counterstrike.\nPerfect Defense: Counterstrike knocks surrounding enemies airborne, paralyzing them and applying Time Lock for 4s and accelerating the character's Attack SPD by 30% for 3s. Perfect Defense base CD: 15s."
    },
    "subskills": [
      {
        "name": "Reflexive Guard",
        "description": "Frontal defense deals 50% ATK of Physical DMG to the attacker. Can be triggered once every 0.5s. Gains 30.0%  Crit Rate for 6.0s during Ultimate Defense."
      },
      {
        "name": "Mech Propulsion",
        "description": "Gain 150% Move Speed when defending with a shield."
      },
      {
        "name": "Absorptive Barrier",
        "description": "When attacked, spend 3 SP to trigger Project Bunny Block, preventing interruption and gaining 20% Total DMG Reduction. Effect does not trigger at 0 SP."
      }
    ]
  },
  "basic": {
    "core": {
      "name": "Charge: Particle Cannon",
      "description": "Charged Cannon ATK. Deals greater DMG at higher charge sequence.\nArm Switch: Changes the way of charging based on the weapon equipped.\nPerfect Cooling: A CD circle will appear when laser weapons overheat. Tap [ATK] right before the circle shrinks to its smallest size to instantly reset the CD and greatly accelerate ATK Speed for a short duration.\nWithin a short duration after activating Perfect Cooling, hitting a target with a laser will inflict a 4s Time Slow  on the target and nearby enemies."
    },
    "subskills": [
      {
        "name": "Dimension Ignite",
        "description": "Each laser beam attack of Basic ATK and Ultimate additionally deals 30% ATK of Fire DMG. Rapid-fire weapon attacks at the 3rd charge sequence gain double bonus Fire DMG."
      },
      {
        "name": "Energy Absorb",
        "description": "Reduces overheat time for rapid-fire weapons by 40.0%.",
        "requiredRank": "ss"
      }
    ]
  }
}
