{
  "id": "eden",
  "version": "5.7",
  "name": "Golden Diva",
  "type": "imaginary",
  "valkyrie": "eden",
  "features": ["lightning-dmg", "time mastery", "paralyze"],
  "equipment": [
    {
      "type": "recommended",
      "weapon": "echo-of-paradise",
      "stigmataTop": "handel-top",
      "stigmataMid": "handel-mid",
      "stigmataBot": "handel-bot"
    }
  ],
  "leader": {
    "core": {
      "name": "This Moment Shines Like Gold",
      "description": "Leader Bonus\nLeader Skill: Increases the team's Lightning DMG by 20.0% and the team's Total DMG by 22.0%."
    },
    "subskills": [
      {
        "name": "This Moment Shines Like Gold",
        "description": "Increases the team's Lightning DMG by 20.0% and the team's Total DMG by 22.0%."
      }
    ]
  },
  "special": {
    "core": {
      "name": "Combo Attack-Romance: Paradise",
      "description": "When Score meets different conditions, hold [ATK] to cast different Combo ATKs.\nChord: Fire rapidly, dealing 5 x 130% ATK of Lightning DMG. Casting it makes the caster enter Performance.\nVariation: Throw a note bomb, dealing 400% ATK of Lightning DMG. Casting it makes the team enter Fascination.\nEnsemble: Hurl pistols, which can spin twice. The first spin deals 200% + 6 x 80% ATK of Lightning DMG and consumes 6 notes. The second spin deals 6 x 25% ATK of Lightning DMG in total. Casting it makes the caster enter Symphony and Performance and the team enter Fascination. Release [ATK] during the second spin to retrieve the pistols. \nDuring Chord and Variation, gain Iron Body and 30% Total DMG Reduction. During Ensemble, become immune to incoming DMG."
    },
    "subskills": [
      {
        "name": "1st Movement: Lights",
        "description": "Performance lasts 8s (triggering it again refreshes the duration). In this state, damaging enemies make them take 30.0% more Lightning DMG for 20s (triggering it again refreshes the duration and it cannot stack)."
      },
      {
        "name": "2nd Movement: Downtown",
        "description": "Fascination lasts 20s (triggering it again refreshes the duration). In this state, Total DMG increases by 40.0%."
      },
      {
        "name": "3rd Movement: After-hours",
        "description": "Symphony lasts 8s (triggering it again refreshes the duration). In this state, a note attack dealing 30.0% ATK of Lightning DMG (CD: 0.3s) follows every Basic ATK or Combo ATK that has damaged an enemy, and Ensemble inflicts 12 x 0.25 Paralyze Trauma in total."
      }
    ]
  },
  "passive": {
    "core": {
      "name": "Requiem: Remembrance",
      "description": "Passive bonuses apply automatically.\nScore: Separated into 2 bars that each holds 3 notes. Using Basic ATK restores 1 note. At 3 notes, use Combo ATK to finish the bar. After finishing 2 bars, use Combo ATK to consume all notes. Consuming a note restores 100 HP."
    },
    "subskills": [
      {
        "name": "1st Movement: Bygones",
        "description": "Upon exit, refreshes the duration of Fascination on all Valkyries on the field.",
        "requiredRank": "s"
      },
      {
        "name": "2nd Movment: Stars",
        "description": "Start battle with 40.0 bonus SP. Triggered once every 10 minutes in Open World.",
        "requiredRank": "ss"
      },
      {
        "name": "3rd Movment: An Epoch",
        "description": "Enemies paralyzed by the team take 20.0% more Total DMG by 10s.",
        "requiredRank": "sss"
      }
    ]
  },
  "ultimate": {
    "core": {
      "name": "Fantasy: Century",
      "description": "Expand a domain and strengthen herself. Pluck strings to play Century Chapter for 15s, dealing 1800% ATK of AoE Lightning DMG, inflicting 12 Paralyze Trauma, and granting Sound of Nature, which makes skill animations negate incoming DMG for 15s. She can move freely while Century Chapter is playing. Upon gaining Sound of Nature, recover all notes and finish all bars. While the buff lasts, auto-recover notes, and tapping [ATK] unleashes Combo ATKs Ensemble (pistols only spin once), Chord, and Variation in order. Score resets when the buff expires.\nSP cost: 125. CD: 17s."
    },
    "subskills": [
      {
        "name": "1st Movement: Contryside",
        "description": "Century Chapter restores 2.0 SP/s for 8s to all Valkyries on the field."
      },
      {
        "name": "2nd Movement: Gunsmoke",
        "description": "In Sound of Nature, increases Combo ATK's Lightning DMG by 20.0%.",
        "requiredRank": "sss"
      },
      {
        "name": "3rd Movement: Epigraphy",
        "description": "If Ultimate hits a Nihilus Seed whose current phase has less than 20% HP, it insta-kills this phase."
      }
    ]
  },
  "evasion": {
    "core": {
      "name": "Waltz: Dream",
      "description": "Quickly dodge enemy attacks. Can be performed twice in a row.\nUltimate Evasion causes a 3s Global Time Fracture (CD: 15s)."
    },
    "subskills": [
      {
        "name": "1st Movement: Sweet Dew",
        "description": "Triggering Ultimate Evasion Skill maxes out the notes in the current bar. Hold [ATK] to use the corresponding Combo ATK."
      },
      {
        "name": "2nd Movement: Joy",
        "description": "If SP is below 100.0 when off the field, recover 5.0 SP/s.",
        "requiredRank": "s"
      }
    ]
  },
  "basic": {
    "core": {
      "name": "Caprice: Starlight",
      "description": "Fire dual pistols\nSEQ 1: 90% ATK of Lightning DMG.\nSEQ 2: 100% ATK of Lightning DMG.\nSEQ 3: 120% ATK of Lightning DMG.\nUsing Basic ATK restores 1 note."
    },
    "subskills": [
      {
        "name": "1st Movement: Nightfall",
        "description": "On hit, the 3rd attacks in the Basic ATK sequence increases Lightning DMG by 30.0% for 3s.",
        "requiredRank": "ss"
      },
      {
        "name": "QTE-2nd Movement: Enlightenment",
        "description": "QTE: Triggered when an enemy is Time-Slowed or a teammate uses weapon active. Causes a 3s Global Time Fracture, deals 1,500.0% + 2 x 50% ATK of Lightning DMG, restores 12.0 SP, finishes the 1st bar, activates Performance, and reduces switch CD to 4s."
      }
    ]
  },
  "sp": {
    "core": {
      "name": "Unique Singing",
      "description": "Release [ATK] when she flashes during Ensemble to unleash Ensemble Playing.\nIt deals 500% ATK of Lightning DMG and inflicts 3.5 Paralyze Trauma. Ensemble Playing negates incoming DMG for its duration. With Sound of Nature, Ensemble Playing is auto-cast during Ensemble."
    },
    "subskills": [
      {
        "name": "Like a Song Above Clouds",
        "description": "On hit, Ensemble Playing restores 2.5 SP and 100.0 HP.",
        "requiredRank": "s"
      },
      {
        "name": "Like a Current in Lake",
        "description": "On hit, Ensemble Playing restores 8.0 SP to the team (CD: 8s). After using Ultimate and before exiting, the first Ensemble Playing causes a 3s Time Fracture.",
        "requiredRank": "ss"
      },
      {
        "name": "Like a Star at Night",
        "description": "Using Ultimate increases Paralyze Trauma from Combo ATK by 25.0% for 10s and Combo ATK's Total DMG by 25.0% for 15s.",
        "requiredRank": "sss"
      }
    ]
  }
}
