{
  "id": "hf",
  "version": "3.5",
  "name": "Hawk of the Fog",
  "type": "psychic",
  "valkyrie": "fuhua",
  "strengths": ["lightning-dmg", "heavy-atk", "paralyze", "time mastery"],
  "leader": {
    "core": {
      "name": "Chelonic Unity",
      "description": "Leader Bonus:\nWhen Combo Hit Count exceeds 30, Mei and Kiana in the team gain 22% Crit Rate; when Combo Hit Count is below 30, Bronya in the team gains 28% Crit DMG."
    },
    "subskills": [
      {
        "name": "Dragon Territory",
        "description": "When Combo Hit Count exceeds 30, Mei and Kiana in the team gain 28% Crit Rate; when Combo Hit Count is below 30, Bronya in the team gains 40% Crit DMG.",
        "requiredRank": "s"
      }
    ]
  },
  "special": {
    "core": {
      "name": "Combo ATK: Lightning Panther",
      "description": "Different Six Fists moves can be connected to various Combo ATKs.\nKei: Whipping Sparks: Launches Ki blades dealing 100% ATK of Lightning DMG per hit (additionally deals 100% ATK of Lightning DMG against enemies outside a 4m radius). Within 1s after hitting enemies outside the 4m radius, tap [ATK] or [ULT] to perform Ki: Lightning Pounce, dashing towards the target and dealing 200% ATK of Lightning DMG.\nKei Taranic Talons: Deals 180% ATK of Lightning DMG.\nKei: Six-Sided Shock: Deals 100% + 8%x80% + 200% ATK of Lightning DMG. Use the joystick to set the finishing position.\nKei: Blasting Palm: After unleashing Kei: Six-Sided Shock, tap [ATK] to perform this Combo, dealing 450% ATK of Lightning DMG and knocking back the target. The target additionally deals 200% ATK of Lightning DMG if knocked into a wall.\nKei: Tunneling Blossom: Tap [ULT] during Kei: Six-Sided Shock to perform, dealing 450% ATK of Lightning DMG. Navigate the charging direction with the joystick."
    },
    "subskills": [
      {
        "name": "Switch Skill: Rending Dive",
        "description": "When switched in, slam the ground to knock enemies airborne, dealing 400% ATK of Lightning DMG. Shielded enemies take 200% ATK of Physical DMG.",
        "requiredRank": "1★"
      },
      {
        "name": "QTE: Sundering Drill",
        "description": "QTE: Triggers when an enemy is ignited or slowed. Slams the ground to deal 800% ATK of Lightning DMG. Shielded enemies take 500% ATK of Physical DMG. Procs a 9s Elektrance status.",
        "requiredRank": "1★"
      },
      {
        "name": "Dragon's Return",
        "description": "For 5s after switch entry, gains Interrupt, Ignore Interrupt, and 20% DMG Reduction for DMG Received; when exiting the battlefield, applies the same buff to all team members for 5.0s.",
        "requiredRank": "ss"
      }
    ]
  },
  "passive": {
    "core": {
      "name": "Passive",
      "description": "Passive bonuses apply automatically."
    },
    "subskills": [
      {
        "name": "Unity Mantra",
        "description": "Team deals 300% ATK of bonus Lightning DMG to enemies when breaking their shields, and deals 30.0% bonus Total DMG for 12.0s. Can be triggered again to reset the duration.",
        "requiredRank": "3★"
      },
      {
        "name": "Vajra Mantra",
        "description": "Gains 30.0% Lightning DMG. Kei: Taranic Talons additionally deals 250.0% ATK of Lightning DMG and paralyzes non-paralyzed enemies for 3.00s. Paralyze effect CD: 8s.",
        "requiredRank": "2★"
      },
      {
        "name": "Shattering Mantra",
        "description": "Character deals 30.0% bonus Total DMG to shielded enemies. Basic ATK, Combo ATK, Switch Skill, and QTE deal 160.0% bonus damage to shields. Hitting shielded enemies grants Interrupt and Interrupt Resist for 10s.",
        "requiredRank": "1★"
      }
    ]
  },
  "ultimate": {
    "core": {
      "name": "Raging Tiamat",
      "description": "Consume 50 SP to unleash burst attacks during Combo ATK.\nIncreases max SP by 50. Hold [ULT] during Kei: Tunneling Blossom or after triggering Time Fracture with Ultimate Evasion to deal 750%x2 ATK of Lightning DMG and gather enemies."
    },
    "subskills": [
      {
        "name": "Teravolt Maul",
        "description": "Ultimate deals 50.0% bonus Total DMG and Paralyzes non-Paralyzed enemies for 5.0s.",
        "requiredRank": "6★"
      },
      {
        "name": "Conductive Impact",
        "description": "Character deals 45.0% bonus Lightning DMG within 18.0s after entry or Ultimate cast.",
        "requiredRank": "3★"
      }
    ]
  },
  "evasion": {
    "core": {
      "name": "Storm Phoenix",
      "description": "Move fast to dodge attacks.\nWithin 3s after Ultimate Evasion, hit enemies with Kei: Whipping Sparks to proc Ki: Lightning Pounce.\nTime Fracture: Ultimate Evasion procs global Time Fracture, slowing all enemies for 3s. CD: 15s."
    },
    "subskills": [
      {
        "name": "Fiery Flock",
        "description": "Ultimate Evasion triggers Time Fracture for the game for 1.50s."
      },
      {
        "name": "Jolting Riposte",
        "description": "The 1st Basic or Combo ATK within 3s after Ultimate Evasion deals 500% ATK of bonus Lightning DMG to the target and nearby enemies, and Paralyzes non-Paralyzed enemies for 4.0s.",
        "requiredRank": "4★"
      },
      {
        "name": "Anser Turn",
        "description": "Shortens CD of Ultimate Evasion 4.00s.",
        "requiredRank": "s"
      }
    ]
  },
  "basic": {
    "core": {
      "name": "Thunder Wyrm",
      "description": "Use the Six Fists for battle.\nThe Six Fists:\n1st Stance: 80% ATK of Physical DMG\n2nd Stance: 80% ATK of Physical DMG\n3rd Stance: 80% ATK of Physical DMG\n4th Stance: 2x100% ATK of Physical DMG\n5th Stance: 2x80% ATK of Physical DMG\n6th Stance: 150% ATK of Physical DMG"
    },
    "subskills": [
      {
        "name": "Tigris Elektra",
        "description": "Ki: Lightning Pounce or Ultimate procs 9s of Elektrance status, during which the Valkyrie gains Ignore Interrupt and 50.0% Total DMG Reduction for DMG received, and each sequence of the 6-sequence Basic ATK additionally deals 75.0% ATK of Lightning DMG.",
        "requiredRank": "1★"
      },
      {
        "name": "Flux Wyrm",
        "description": "During Elektrance status, each 1st sequence of Basic ATK boosts Total DMG of the next Kei: Six-Sided Shock by 14.0%. 5 stacks max.",
        "requiredRank": "2★"
      },
      {
        "name": "Inductive Trauma",
        "description": "During Elektrance status, restores 3.00 SP upon unleashing Kei: Taranic Talons or Kei: Six-Sided Shock; CD: 5s.  Each Taranic Talons hit additionally deals 50.0% ATK of Physical DMG; effect doubles against shielded enemies.",
        "requiredRank": "2★"
      }
    ]
  }
}
