{
  "id": "hos",
  "version": "4.6",
  "name": "Herrscher of Sentience",
  "type": "biologic",
  "valkyrie": "fuhua",
  "strengths": ["physical", "impair", "burst", "time mastery", "gather"],
  "leader": {
    "core": {
      "name": "Alliteration is an Agony",
      "description": "Leader Bonus:\nTeam deals 26% Crit DMG in burst mode. For every BIO battlesuit on the team, team has 4% bonus Crit Rate."
    },
    "subskills": [
      {
        "name": "Alliteration is an Agony",
        "description": "Team deals 30.0% Crit DMG in burst mode. For every BIO battlesuit on the team, team has 6.0% bonus Crit Rate.",
        "requiredRank": "s2"
      }
    ]
  },
  "special": {
    "core": {
      "name": "Combo: Transcendence of Trinity",
      "description": "Hold [ATK] to perform enhanced attacks.\nConsume full kinetic energy of the current weapon to perform Combo ATK.\nSword: Gather and Time-Lock enemies to smite them dealing 1390% ATK of Physical DMG.\nSpear: Hurl the spear to gather and strike enemies before blinking over to follow up dealing 820% ATK of Physical DMG.\nChain blades: Launch AOE attacks dealing 850% ATK of Physical DMG and inflicting 1.2s of coma on enemies."
    },
    "subskills": [
      {
        "name": "Riding the Blade Waves",
        "description": "Every weapon switch or QTE grants 5s of Psyched status where the next Combo ATK restores 5.0 bonus SP and removes the status."
      },
      {
        "name": "Spear Stands for Strength",
        "description": "Spear Combo ATKs impair enemies and reduce their DEF by 50% for 15.0s."
      },
      {
        "name": "Mercy Means Meekness",
        "description": "In Psyched status, Combo ATKs restore 2 bonus SP and have special effects:Sword: The 2nd sequence inflicts 0.5s of coma on enemies hit. Spear: The 1st sequence Time Locks enemies for 1s on hit. Chain blades: Attacks impair enemies and reduce their DEF by 50% for 15s.",
        "requiredRank": "ss"
      }
    ]
  },
  "passive": {
    "core": {
      "name": "Ace Arsenal",
      "description": "Passive bonuses apply automatically.\nEvery weapon has an independent gauge of kinetic energy that starts at 300 and maxes at 300. Recovery:The weapon in use restores 3 points every 0.1s.Weapons not in use restore 1 point every 0.1s.Sword & spear: Every hit of Basic ATK restores 9 points.\nChain blades: every hit of Basic ATK restores 12 points.\nAll weapons restore 300 points when Herrscher form ends.\n\nCertain attacks inflict coma on enemies. Enemies in a coma are immobilized and take 200% ATK of Physical DMG when the coma ends."
    },
    "subskills": [
      {
        "name": "Innate Invulnerability",
        "description": "Combo ATKs grant Shield: I'm Untouchable to all unshielded team members. Shield HP equals 30% of Valkyrie's max HP. The shield grants 50% DMG Reduction, moderate Ignore Interrupt, and boosts team Crit DMG by 30.0%. Subsequent procs refresh the shield. CD: 12s."
      },
      {
        "name": "Stellar Start",
        "description": "Valkyrie has 20.0 bonus initial SP. Can only be triggered once every 10 minutes in Open World.",
        "requiredRank": "sss"
      },
      {
        "name": "Against All Authority",
        "description": "When Valkyrie sends an enemy into coma, they take 15.0% bonus Physical DMG from her for 15s (independent effect). In addition, when she impairs enemies with her own skills, they take 15.0% bonus Physical DMG while the Impair lasts (independent effect; mutually exclusive with Night Squire's skill Authority)."
      }
    ]
  },
  "ultimate": {
    "core": {
      "name": "A Worldful of Woes",
      "description": "Enter Herrscher form and use the weapon case to attack.\nHold [ULT] to enter Herrscher form, create an illusive space, and launch spiritual attacks on enemies in a large area, dealing 1800% ATK of Physical DMG. This attack has 40% bonus Crit Rate and temporarily suspends all skill timers (for self and enemies) and the stage timer.\n\nIn Herrscher form (burst mode), all enemies are impaired and have 75% less DEF, while Valkyrie has improved Ignore Interrupt and 40% Total DMG Reduction for 15s.Tap [ATK] repeatedly to perform a 3-sequence combo dealing 1120% ATK of Physical DMG.\nHold [ATK] to perform Combo ATK: Slashes dealing Nx105% + (800% + Nx50%) ATK of Physical DMG. Spam or hold [ATK] to increase slashes (max: 10). Every slash boosts self Total DMG by 2% until the Combo ATK ends.\nTap [ULT] to launch special ATK: Illusive Cataclysm, gathering enemies in a large area and dealing 350% ATK of Physical DMG. CD: 8s. The cataclysm lasts until the end of Herrscher form and enemies on it will not be knocked back.\nSP cost: 125."
    },
    "subskills": [
      {
        "name": "A Leaf for Lifeboat",
        "description": "In Herrscher form, Valkyrie deals 60.0% bonus Crit DMG."
      },
      {
        "name": "Warden of the World",
        "description": "In Herrscher form, attacks from teammates summon a plume attack from HoS on hit, dealing 180.0% ATK of Physical DMG. CD: 0.5s. 15 procs max."
      },
      {
        "name": "Votive in Vain",
        "description": "Using Ultimate or special ATK triggers a shield. Special ATK additionally inflicts 1.0s of coma on hit."
      }
    ]
  },
  "evasion": {
    "core": {
      "name": "A Wraith without Trace",
      "description": "Quickly dodge enemy attacks. Can be performed twice in a row.\nUltimate Evasion triggers 2.5s of global Time Fracture. Base CD: 20s. Minimum CD: 16s.\n\nEvasions create an Illusion: Hit Me! lasting 3s which taunts enemies and explodes when hit or expired. The explosion deals 400% ATK of Physical DMG and procs Ultimate Evasion skill on hit. Only one illusion can exist and they cannot be created while Ultimate Evasion skill is in cooldown.\n\nIn non-Herrscher form, Valkyrie begins sword riding after running for a duration and deals 50% ATK of Physical DMG per 0.5s to enemies nearby. Weapon switch ATKs are disabled while sword riding. Tap [ATK] to deal 150% ATK of Physical DMG and end sword riding."
    },
    "subskills": [
      {
        "name": "Blown away with a Big Bang",
        "description": "Illusions can be detonated by Valkyrie attacks."
      },
      {
        "name": "The Wicked Will never Win",
        "description": "Illusion explosions deal 400.0% ATK of bonus Physical DMG.",
        "requiredRank": "ss3"
      },
      {
        "name": "Fluffy and Florescent",
        "description": "When illusions explode, they drop a black plume on hit. Pick it up to restore 150.0 HP and 15.0 SP for all team members."
      }
    ]
  },
  "basic": {
    "core": {
      "name": "Trial of Trinity",
      "description": "Use the sword/spear/chain blades to attack.\nSword: 4 sequences dealing 810% ATK of Physical DMG.\nSpear: 5 sequences dealing 775% ATK of Physical DMG. The 2nd & 5th sequences gather enemies.\nChain blades: 3 sequences dealing 750% ATK of Physical DMG.\n\nTap [ULT] to switch weapon and perform weapon switch attack.\nSword to spear: Connect into the 2nd sequence of spear Basic ATK.\nSpear to chain blades: 160% ATK of Physical DMG.\nChain blades to sword: 160% ATK of Physical DMG."
    },
    "subskills": [
      {
        "name": "The Best of Both Worlds",
        "description": "Upon entry or exit, Valkyrie deals 30.0% bonus Total DMG for 15s."
      },
      {
        "name": "The World Is Never Enough",
        "description": "In non-Herrscher form, attacks restore 2.0 SP and 30.0 kinetic energy for all weapons on hit. Only procs once every 5s for every weapon."
      },
      {
        "name": "QTE: Always Here, Always Ready",
        "description": "Triggered by Time-Slowed enemies in non-Herrscher form to launch spear attacks dealing 400.0% + 800.0% ATK of Physical DMG and restoring 300 spear energy."
      }
    ]
  }
}
