{
  "id": "ns",
  "version": "2.5",
  "name": "Night Squire",
  "type": "biologic",
  "valkyrie": "fuhua",
  "features": ["physical", "burst", "time mastery", "fast atk", "bleed"],
  "leader": {
    "core": {
      "name": "Night Squire",
      "description": "Leader Bonus:\nCourt Astrologer: Team gains 12.0% max HP. BIO-type characters gain 24.0% Crit DMG."
    },
    "subskills": [
      {
        "name": "Night Squire",
        "description": "Team gains 18.0% max HP. BIO-type characters gain 36.0% Crit DMG.",
        "requiredRank": "s"
      }
    ]
  },
  "special": {
    "core": {
      "name": "Combo: Aurora",
      "description": "Different Six Fists moves can be connected to various Combo ATKs.\nRi-Ki Raptor Strike: Up to 400% ATK of Physical DMG.\nRi-Ki Rending Claw: Up to 460% ATK of Physical DMG.\nRi-Ki Talon Storm: Up to 490% ATK of Physical DMG.\nRi-Ki Moon Anseri: Up to 520% of ATK of Physical DMG.\nInitial Ripple: 3. Can store up to 5 charges."
    },
    "subskills": [
      {
        "name": "Switch: Seven Deaths",
        "description": "Deals 360.0% ATK of Physical DMG."
      },
      {
        "name": "QTE: Emperor's Ax",
        "description": "QTE: Triggered when enemy is knocked airborne, dealing 900.0% ATK of Physical DMG. If the Combo ATK hits the enemy, trigger a global Time Fracture for 3.0s."
      },
      {
        "name": "Enigma",
        "description": "Recovers 1 Ripple every 2.5s when off the field. When exiting with 0 Ripple, team gains 15.0% Total DMG Multiplier for 10.0s.",
        "requiredRank": "ss"
      }
    ]
  },
  "passive": {
    "core": {
      "name": "Passive",
      "description": "Passive bonuses apply automatically."
    },
    "subskills": [
      {
        "name": "Magister",
        "description": "When the character has Ripple, last hit of Combo ATKs consumes 1 Ripple (will not be consumed again with Vanguard) and gains 40.0% ATK of Physical DMG for 4.0s. Consuming the Ripple again resets the duration.",
        "requiredRank": "s"
      },
      {
        "name": "Imperator",
        "description": "With available Ripple, attacks against bleeding, ignited, or move slowed enemies gain 30.0% Total DMG Multiplier.",
        "requiredRank": "s"
      },
      {
        "name": "Catastrophe",
        "description": "When the last strike of Ri-Ki Raptor or Ri-Ki Rending Claw hits an enemy, mark the enemy with a brand for 10.0s. When the last strike of Ri-Ki Talon Storm or Ri-Ki Moon Anseri hit said enemy or when the brand expires, clear the brand. Said enemy will then take an additional 200.0% ATK of Physical DMG.",
        "requiredRank": "s"
      }
    ]
  },
  "ultimate": {
    "core": {
      "name": "Thousand Stars",
      "description": "Consume 100 SP to enter Burst mode for 8s.\nBurst mode: Gain 30% Attack Speed. Tapping any [ATK] button quickly directly triggers Combo ATK to deal tons of DMG.\nDuring Burst Mode: Enemies in a small AOE around the character suffer 50% slower Move Speed.\nBurst mode activation provides max Ripple."
    },
    "subskills": [
      {
        "name": "Devouring Wolf",
        "description": "Under Burst mode, gain a 80.0% Attack Speed buff.",
        "requiredRank": "s"
      },
      {
        "name": "Authority",
        "description": "Under Burst mode, enemies within a small AOE around the Valkyrie take 40.0% more Physical DMG (independent effect).",
        "requiredRank": "sss"
      },
      {
        "name": "Red Princess",
        "description": "Under Burst mode, character bleeds nearby enemies in a small AOE, dealing 150.0 Physical DMG every 0.5s.",
        "requiredRank": "ss"
      }
    ]
  },
  "evasion": {
    "core": {
      "name": "Blink",
      "description": "Quick shift for evading enemy attacks.\nTime Fracture: Ultimate Evasion triggers global Time Fracture, slowing all enemies for 3s. CD: 15s.\nGain 1 Ripple with Ultimate Evasion."
    },
    "subskills": [
      {
        "name": "Vengeance",
        "description": "Extends duration of Time Fracture of Ultimate Evasion to 4.5s."
      },
      {
        "name": "Inquisitor",
        "description": "Shortens CD of Ultimate Evasion skill by 4.0s. Upon triggering Time Fracture, character gains 25.0% Crit Rate.",
        "requiredRank": "s"
      }
    ]
  },
  "basic": {
    "core": {
      "name": "Iron Strike",
      "description": "Fight using the Six Fists.\nRi-Ki Darting Kite: 400% ATK of Physical DMG.\nRi-Ki Phoenix Soar: 370% ATK of Physical DMG."
    },
    "subskills": [
      {
        "name": "Chancellor",
        "description": "When Ri-Ki Darting Kite and Ri-Ki Phoenix Soar hit an enemy, gain 1 Ripple and Iron Body to take 40.0% less Physical DMG for 5.0s."
      },
      {
        "name": "Vanguard",
        "description": "When the character has stored charge, final hit of Combo ATKs consumes 1 Ripple (this will not be consumed again with Magister). This Combo ATK deals an additional 300.0% ATK of Physical DMG."
      },
      {
        "name": "Marshal",
        "description": "Whenever the last strike of Combo ATKs hit the enemy, gain 4.0% Crit Rate for 5.0s. Stacks up to 5 times. Triggering this skill again resets the duration.",
        "requiredRank": "s"
      }
    ]
  }
}
