{
  "id": "nyx",
  "version": "4.8",
  "name": "Starchasm Nyx",
  "type": "quantum",
  "valkyrie": "seele",
  "features": ["ice-dmg", "burst", "time mastery", "freeze"],
  "leader": {
    "core": {
      "name": "A Torn Heart",
      "description": "Leader Bonus:\nLeader Bonus: Team deals 30.0% more Ice DMG. With Bronya on the team, team's Charged ATKs deal 35.0% more Total DMG."
    },
    "subskills": [
      {
        "name": "A Torn Heart",
        "description": "Team deals 30.0% more Ice DMG. With Bronya on the team, team's Charged ATKs deal 35.0% more Total DMG.",
        "requiredRank": "s3"
      }
    ]
  },
  "special": {
    "core": {
      "name": "Condemning Blade",
      "description": "Hold [ATK] to perform a Charged ATK.\nIn normal form, her Charged ATK consumes all Carmine Gashes, teleports her in front of the target and deals 300% ATK of Ice DMG.\nIn Burst form, she can continuously consume Carmine Gashes to unleash Charged ATKs (each deals 2x270% ATK of Ice DMG) until she exhausts all of them, during which she has Iron Body. Each Charged ATK accelerates the next Charged ATK; Charged ATK Speed maxes after 3 Charged ATKs.\nDuring Burst form, casting Charged ATKs teleports her in front of enemies and activates her Ultimate Evasion skill Ceaseless Carousal."
    },
    "subskills": [
      {
        "name": "The Cold-blooded Prince",
        "description": "In normal form, Charged ATK additionally deals Nx4x60.0% ATK of Ice DMG and restores Nx1.5 SP (N = the number of Carmine Gash consumed); when 6 Carmine Gashes are consumed in one go, enemies will be frozen for 2s and lose 50% Move Speed for 5s."
      },
      {
        "name": "Herd of Kids",
        "description": "Starchasm Nyx gains 10.0% Total DMG, and her Charged ATKs deal 32.0% more Total DMG."
      },
      {
        "name": "The Star Coins",
        "description": "During Burst, Charged ATK additionally deals 2x20.0% ATK of Ice DMG.",
        "requiredRank": "sss"
      }
    ]
  },
  "passive": {
    "core": {
      "name": "Hagridden Night",
      "description": "Passive bonuses apply automatically.\nIn normal form, the 1st, 2nd, 3rd and 4th sequences of Basic ATK each restores 1 Carmine Gash, and the 5th restores 2.In Burst mode, the 1st and 2nd sequences of Basic ATK each restores 1 Carmine Gash, and the 3rd and 4th each restores 2.Carmine Gash max out at 6. Each excessive Carmine Gash turns into 1 SP.\nDuring Burst, Nightmare Stage will take effect throughout."
    },
    "subskills": [
      {
        "name": "The Lonely Beast",
        "description": "For every 45 Ice DMG hits taken by enemies within Nightmare Stage, they additionally take 300.0% ATK of Ice DMG and are Frozen for 2s, and Starchasm Nyx gains 1 Carmine Gash."
      },
      {
        "name": "The Snowy Garden",
        "description": "Enemies within Nightmare Stage take 18.0% Ice DMG from Starchasm Nyx's attacks (independent effect)."
      }
    ]
  },
  "ultimate": {
    "core": {
      "name": "Moment of Collapse",
      "description": "Starchasm Nyx attacks with chain claws.\nTap [ULT] to activate Burst mode, deal 700% ATK of Ice DMG and inflict one Quantum Implosion on QUA enemies.\nDuring Burst mode, Starchasm Nyx fights with her chain claws Blood & Love.\n1st Sequence: 360% ATK of Ice DMG2nd Sequence: 440% ATK of Ice DMG3rd Sequence: 660% ATK of Ice DMG4th Sequence: 780% ATK of Ice DMGDuring Burst mode, tap [ULT] again to unleash Time of Metamorph, dealing 900% ATK of Ice DMG and end Burst, during which all skill timers (for self and enemies) and the stage timer are temporarily suspended.\n\nActivation cost: 75 SP. CD: 12s. CD starts after Time of Metamorph.\nBurst lasts for up to 17s and ends when Starchasm Nyx leaves the field."
    },
    "subskills": [
      {
        "name": "Broken Lead Heart",
        "description": "Burst activation restores Carmine Gashes to 6. During Burst, Starchasm Nyx gains 50.0% Ice DMG and takes 50.0% less Total DMG."
      },
      {
        "name": "Burnt Matches",
        "description": "Ultimate deals 50.0% more Total DMG. When casting Time of Metamorph, for each SP consumed, the skill additionally deals 120.0% ATK of Ice DMG (cap: 15 SP)."
      },
      {
        "name": "Sleeping Thorns",
        "description": "Casting Moment of Collapse will inflict Nightmare Thorns on up to 5 enemies hit and disable their Soul Link(s). 14.0% of the damage taken by each of said enemies will be passed on to the rest (effect: HP loss)."
      }
    ]
  },
  "evasion": {
    "core": {
      "name": "Aria of Torment",
      "description": "Quickly dodge enemy attacks up to twice in a rowPerforming an Ultimate Evasion triggers Ultimate Evasion skill Ceaseless Carousal.[Ceaseless Carousal]: Triggers a 3-sec global Time Fracture and restores 1 Carmine Gash.\nIn normal form, tap [ATK] to connect into the 4th sequence of Basic ATK. CD: 15s."
    },
    "subskills": [
      {
        "name": "The Lost Fledgling",
        "description": "CD of Ceaseless Carousal is shortened by 4.0s."
      },
      {
        "name": "The Voiceless Mermaid",
        "description": "A successful evasion additionally restores 2 SP."
      },
      {
        "name": "QTE: Blood-Crimsoned Rose",
        "description": "QTE: Triggered by Time Slow or enemies being knocked into the air. Deals 1,100% ATK of Ice DMG and generates 1 Carmine Gash."
      }
    ]
  },
  "basic": {
    "core": {
      "name": "Anguished Cry",
      "description": "Starchasm Nyx wields her scythe to attack.\n1st Sequence: 50% ATK of Physical DMG + 80% ATK of Ice DMG2nd Sequence: 70% ATK of Physical DMG + 120% ATK of Ice DMG3rd Sequence: 100% ATK of Physical DMG + 180% ATK of Ice DMG4th Sequence: 35%x(4~8) ATK of Ice DMG according to the duration of the attack pause, and pulls in surrounding enemies for a short time.\n5th Sequence: 460% ATK of Ice DMG."
    },
    "subskills": [
      {
        "name": "The Ragged Hood",
        "description": "The Valkyrie gains Iron Body and receives 50.0% less damage during the 5th sequence of Basic ATK."
      },
      {
        "name": "The Poisoned Apple",
        "description": "The 4th sequence of Basic ATK deals 70.0% more Ice DMG. Each landed hit additionally restores 1 SP.",
        "requiredRank": "ss"
      },
      {
        "name": "Bitter Sweets",
        "description": "The 5th sequence of Basic ATK releases chain claws to additionally deal 360.0% ATK of Ice DMG and restores 1 Carmine Gash.",
        "requiredRank": "s2"
      }
    ]
  }
}
