{
  "id": "px",
  "version": "2.4",
  "name": "Phoenix",
  "type": "psychic",
  "valkyrie": "fuhua",
  "features": ["fire-dmg", "time mastery", "weaken"],
  "leader": {
    "core": {
      "name": "Flaming Heart",
      "description": "Leader Bonus:\nFlaming Heart: Team gains 10% Attack Speed. Teams with 3 PSY-type characters gain 28% Total DMG Multiplier to combo, charged, and ultimate attacks."
    },
    "subskills": [
      {
        "name": "Flaming Heart",
        "description": "Team gains 16% Attack Speed. For teams with 3 PSY-type characters, combo, charged, and ultimate attacks gain 36% Total DMG Multiplier.",
        "requiredRank": "ss"
      }
    ]
  },
  "special": {
    "core": {
      "name": "Combo: Flame Gust",
      "description": "Stances can be connected into different Combo ATKs.\nSen-Ki Simurgh: Up to 460% ATK of Physical DMG.\nSen-Ki Dashing Tern: Up to 660% ATK of Physical DMG.\nSen-Ki Moon Anseri: Up to 660% ATK of Physical DMG.\nWhen using a different combo ATK move compared to last time (or when the attack move has been reset), then Sen-Ki Simurgh/Dashing Tern/Moon Anseri will gain 150/200/150 Prajna respectively.\nCharacter can store up to 400 Prajna, and Prajna will slowly drain. Higher Prajna will improve"
    },
    "subskills": [
      {
        "name": "Switch: Red Sparrow",
        "description": "Deals 300.0% ATK of Physical DMG."
      },
      {
        "name": "QTE: Thrush",
        "description": "QTE: Triggered when enemy is ignited, deals 800.0% ATK of Fire DMG to enemies in a large AOE, and recovers 100 Prajna."
      },
      {
        "name": "Oriole",
        "description": "When exiting, if Prajna is greater than 100/300, then enemies take 12.0%/20.0% more Elemental DMG for 12.0 s.",
        "requiredRank": "ss"
      }
    ]
  },
  "passive": {
    "core": {
      "name": "Passive",
      "description": "Passive bonuses apply automatically."
    },
    "subskills": [
      {
        "name": "Herald of Dawn",
        "description": "If the last hit of Sen-Ki Simurgh weakens enemies with a Firebrand, and reduces their ATK by 30.0% for 5s. If Sen-Ki Dashing Tern passes through enemies with a scorched mark, deal additional 120.0% ATK of Fire DMG in an AOE blast at the enemy location. When the last hit of Sen-Ki Moon Anseri hits an enemy with a scorched mark, they receive additional 200.0% ATK of Fire DMG."
      },
      {
        "name": "Rainbow Pinion",
        "description": "When Prajna is over 200, and when last strike of Combo ATKs hit, character gains 50.0% Elemental DMG. Team also gains 30.0% Elemental DMG for 12.0s."
      },
      {
        "name": "Crucible",
        "description": "When Prajna is over 100, enemies hit by the last sequence of Basic or Combo ATK are stunned by 1.5s. The stun trigger has a 5s CD.",
        "requiredRank": "sss"
      }
    ]
  },
  "ultimate": {
    "core": {
      "name": "Spirit of Cinder",
      "description": "Transform into the Spirit of Cinder to deal large AOE damage.\nSpirit of Cinder: 1500% ATK of Fire DMG to enemies in a large AOE.\nSpirit of Cinder resets attack moves (any Combo ATK afterwards will gain Prajna).\nSP Cost: 100"
    },
    "subskills": [
      {
        "name": "Carmine Down",
        "description": "During Burst, gain 50% Total DMG Multiplier for 8.0s, gain 200 Prajna, and inflicts Time Lock on hit enemies for 6.0s."
      },
      {
        "name": "Diving Phoenix",
        "description": "During Burst, deal 750.0% ATK of Fire DMG to all enemies bearing the Firebrand in a large AOE."
      },
      {
        "name": "Fire Raven",
        "description": "When ending, Ultimate ignites all enemies, deals 30% ATK of Fire DMG every 0.5s for 10s, and inflicts 6 Ignite Trauma. When Prajna reaches 100/200/300, enemies receive 10.0%/15.0%/20.0% ATK of bonus Fire DMG per 0.5s.",
        "requiredRank": "ss"
      }
    ]
  },
  "evasion": {
    "core": {
      "name": "Fairy Dance",
      "description": "Quickly blinks to the enemy to attack.\nMass Immobilize: Ultimate Evasion inflicts Time Lock on the target and nearby enemies in a small AOE for 1.5s. CD: 15s.\nUltimate Evasion  resets attack move (any Combo ATK afterwards will gain Prajna).\nTap [Ultimate] after Ultimate Evasion to directly perform Sen-Ki Dashing Tern's Shuttle ATK, during which and the following 1s, tap [Ultimate] again to unleash another Shuttle ATK (once only)."
    },
    "subskills": [
      {
        "name": "Nightingale",
        "description": "Ultimate Evasion gives 100 Prajna. Also extends duration of Ultimate Evasion Time Lock to 4.0s."
      },
      {
        "name": "Morning Wind",
        "description": "Shortens CD of Ultimate Evasion by 3.0s. Upon Ultimate Evasion, gain 30.0% Fire DMG for 8.0s."
      }
    ]
  },
  "basic": {
    "core": {
      "name": "Rectrix",
      "description": "Fight enemies using Punch Arts.\nSen-Ki Darting Swift: Up to 660% ATK of Physical DMG.\nSen-Ki Phoenix Soar: Up to 470% ATK of Physical DMG.\nLast sequence of Basic ATK resets the attack move (any Combo ATK afterwards will gain Prajna)."
    },
    "subskills": [
      {
        "name": "Cuckoo Cry",
        "description": "Last hit of Sen-Ki Darting Swift or Sen-Ki Phoenix Roar deals 80.0% ATK of Fire DMG. Last hit of Sen-Ki Simurgh, Sen-Ki Dashing Tern, or Sen-Ki Moon Anseri deals an additional 40.0% ATK of Fire DMG. When Prajna is 100/200/300 or higher, DMG dealt will be increased to 150%/200%/250% of the original DMG respectively."
      },
      {
        "name": "Hysteria",
        "description": "Combo and burst attacks add a Firebrand to enemies. Hitting a marked enemy deals an additional 150.0% ATK of Fire DMG (CD: 1.5s). Duration: 20.0s. When Prajna is 100/200/300 or higher, DMG dealt will be increased to 150%/200%/250% of the original DMG respectively."
      },
      {
        "name": "Peregrine",
        "description": "If last strike of Sen-Ki Darting Swift or Sen-Ki Phoenix Soar hits an enemy marked by Firebrand, then drop an SP pack. CD: 20.0s."
      }
    ]
  }
}
