{
  "id": "sj",
  "version": "2.7",
  "name": "Sündenjäger",
  "type": "mecha",
  "valkyrie": "kallen",
  "features": ["physical", "impair", "fast atk"],
  "leader": {
    "core": {
      "name": "Kindred's Link",
      "description": "Leader Bonus:\nKindred's Link: Team gains 25% Move SPD. MECH-type characters gain 14% Attack Speed."
    },
    "subskills": [
      {
        "name": "Kindred's Link",
        "description": "Team gains 25% Move Speed. MECH-type characters gain 14% Attack Speed.",
        "requiredRank": "s"
      }
    ]
  },
  "special": {
    "core": {
      "name": "Combo: Purifier's Brand",
      "description": "Unleash a powerful shot after the 1st sequence of the Basic ATK:\nPower Shot: 300% ATK of Physical DMG against targets along a straight line; targets hit will be marked with a Hunted Brand for 13s."
    },
    "subskills": [
      {
        "name": "Heart of Rage",
        "description": "Deal 35.0% more DMG against shields.",
        "requiredRank": "s"
      },
      {
        "name": "Feast of Mammon",
        "description": "Under Holy Salve, Basic ATKs that hit an unignited enemy have a 11.0% chance to ignite said enemy to deal 35.0% ATK of Fire DMG every 0.5s for 5s."
      },
      {
        "name": "Ward of Sloth",
        "description": "When exiting with Holy Salve active, slows ATK Speed and Move Speed of nearby enemies by 80% and weakens them to make them deal 80% less Total DMG. Effect lasts 4s.",
        "requiredRank": "ss"
      }
    ]
  },
  "passive": {
    "core": {
      "name": "Passive",
      "description": "Character automatically gains passive bonuses.\nUpon performing an Ultimate Evasion, character gains a continuous Holy Brand effect for 60s. If another Ultimate Evasion is triggered during that duration, the mark will be cleared and the character will receive a Holy Salve effect for 10s. If the character HP is below 30% of max HP, then quickly heal 200 HP/s."
    },
    "subskills": [
      {
        "name": "Divine Huntress",
        "description": "While Holy Salve effects are active, character gains 45.0% DEF."
      },
      {
        "name": "Breath of Gluttony",
        "description": "Holy Salve gain 50.0% Max Healing.",
        "requiredRank": "ss"
      },
      {
        "name": "Shade of Envy",
        "description": "Against ignited or bleeding enemies, gain 20.0% to Total DMG Multiplier."
      }
    ]
  },
  "ultimate": {
    "core": {
      "name": "Barrage Macabre",
      "description": "Suit up in a powered battlesuit to unleash raw devastation.\nPowered Battlesuit: Tap and hold the [ATK] button to continuously attack enemies in front of you.\nSP cost: 125; CD: 30s; Ultimate Skill duration: 10s.\nAutorifle Attack: deals 50% ATK of Physical DMG and impairs enemies (if not yet impaired), reducing their DEF by 50% for 10s.\nMissile Attack: deals 50% ATK of Physical DMG.\nRestructure: During Ultimate, if character HP is below 25% max HP, then heal 200 HP/s. Character cannot be killed throughout the skill duration, but will also be unable to switch for other characters."
    },
    "subskills": [
      {
        "name": "Revelation",
        "description": "Summons orbital bombardment attacks (lasts 15s) upon Ultimate activation, dealing 150% ATK of Physical DMG per second and inflicting a 13s Hunted Mark. Effect ceases immediately when the Valkyrie leaves the battlefield.",
        "requiredRank": "ss"
      },
      {
        "name": "Brand of Despair",
        "description": "Ultimate gains 15.0% Total DMG Multiplier against enemies marked by the Hunted Brand."
      },
      {
        "name": "Sun of Ragnarok",
        "description": "For 15s after casting Ultimate, continuously ignite enemies within a large AOE to deal 80.0% ATK of Fire DMG every 0.5s. Skill effects ends once the character exits.",
        "requiredRank": "sss"
      }
    ]
  },
  "evasion": {
    "core": {
      "name": "Kindred's Feint",
      "description": "Quickly evade enemy attacks. Can be performed twice in a row.\nShadow: Upon performing an Ultimate Evasion, deals 200% ATK of Physical DMG against nearby enemies and inflicts a 13s Hunted Mark.\nHoly Brand: Gained upon an Ultimate Evasion, boosting Physical DMG by 15% for 10s; CD: 15s\nFollow-up: Tap [ATK] within 3s after an Ultimate Evasion to immediately cast Sturmgeschütz."
    },
    "subskills": [
      {
        "name": "Phantom Walk",
        "description": "After evasion or switch entry, character takes 30.0% less Physical and Elemental DMG for 6.0s. CD: 15s"
      },
      {
        "name": "Lucid Strike",
        "description": "After Ultimate Evasion, character's Physical DMG skill effects gain 30.0%."
      },
      {
        "name": "Reach of Desire",
        "description": "Shortens CD of Ultimate Evasion by 2.00s. Restore 70.0 HP upon a successful Ultimate Evasion. If current HP is below 50%, additionally restores 70.0 HP. Healing effect CD: 5s",
        "requiredRank": "s"
      }
    ]
  },
  "basic": {
    "core": {
      "name": "Nocturnal Cantata",
      "description": "Activates Sturmgeschütz attack after the 3 Basic ATK sequences.\nThe direction of Sturmgeschütz can be controlled using the joystick.\n1st sequence: 2x40% ATK of Physical DMG.\n2nd sequence: 2x40% ATK of Physical DMG.\n3rd sequence: 2x50% ATK of Physical DMG.\nSturmgeschütz: Deals 4x50% ATK of Physical DMG and impairs the targets (if not yet impaired), reducing their DEF by 50% for 10s.\nSturmgeschütz deals 100%x2 ATK of Physical DMG against all enemies with a Hunted Brand within a 10m range. If there are no more than 3 enemies on the battlefield, Sturmgeschütz will deal 200%x2 ATK of Physical DMG instead."
    },
    "subskills": [
      {
        "name": "Sin Stalker",
        "description": "During the 3rd sequence of the Basic ATK and Sturmgeschütz, the Valkyrie gains Iron Body and takes 70.0% less Physical and Elemental DMG."
      },
      {
        "name": "Sanguine Feast",
        "description": "Each time Sturmgeschütz is activated, the Valkyrie's Basic ATKs and Ultimate ATKs gain 8.00% Total DMG for 13s. Effect can be stacked up to 6 times. Triggering this effect again resets the duration. The Valkyrie loses 2 stacks of said buff effect when attacked outside the skill duration of Sturmgeschütz or Ultimate.",
        "requiredRank": "s"
      },
      {
        "name": "QTE: Erosive Pride",
        "description": "QTE: Triggered when enemy is knocked airborne or shield break. Deals 7x140% ATK of Physical DMG to nearby enemies and gain 1 stack of Sanguine Feast buff. Tap the [ATK] button within 3s after using QTE to unleash Sturmgeschütz."
      }
    ]
  }
}
