{
  "id": "spa",
  "version": "5.5",
  "name": "Spina Astera",
  "type": "mecha",
  "valkyrie": "rita",
  "features": ["fire-dmg", "ignite", "time mastery", "gather"],
  "equipment": [
    {
      "type": "recommended",
      "weapon": "astral-divide-pisces",
      "stigmataTop": "ragna-top",
      "stigmataMid": "ragna-mid",
      "stigmataBot": "ragna-bot"
    }
  ],
  "leader": {
    "core": {
      "name": "Thuban: Circumpolar Star",
      "description": "Leader Bonus\nLeader Skill: Combo/Charged ATKs from any team member deal 34.0% bonus Total DMG. With at least one non-MECH Valkyrie on the team, team deals 40.0% bonus Fire DMG."
    },
    "subskills": [
      {
        "name": "Thuban: Circumpolar Star",
        "description": "Combo/Charged ATKs from any team member deal 34.0% bonus Total DMG. With at least one non-MECH Valkyrie on the team, team deals 40.0% bonus Fire DMG.",
        "requiredRank": "s3"
      }
    ]
  },
  "special": {
    "core": {
      "name": "Charged ATK: Coma Berenices: Cluster",
      "description": "Charged ATK unleashes Void Vortex.\nAt 600 Astrum, hold [ATK] to perform: Charged ATK - Astral Flare: Ignite: Induce Astral Harness state and unleash Void Vortex to deal 12 x 20% + 200% ATK of Fire DMG.\n\nIn Astral Harness and with Void Vortex present, hold [ATK] to perform:\nCharged ATK - Astral Flare: Combust: Deal 4 x 30% ATK of Fire DMG and unleash Void Vortex EX to deal 12 x 30% ATK of Fire DMG.\n\nIn Astral Harness and with Void Vortex EX present, hold [ATK] to perform:\nCharged ATK - Astral Flare: Erupt: Drive Void Vortex forward to gather enemies in a large area dealing 4 x 20% ATK of Fire DMG and then unleash the final blow dealing 1300% ATK of Fire DMG. Casting the Charged ATK ends Astral Harness and resets Astrum."
    },
    "subskills": [
      {
        "name": "β Coma Berenices",
        "description": "Astral Harness grants 40.0% bonus Total DMG, boosts Ignore Interrupt, and reduces Total DMG taken by 40.0%."
      },
      {
        "name": "α Coma Berenices",
        "description": "Astral Flare: Erupt restores 10.0 SP.",
        "requiredRank": "ss"
      }
    ]
  },
  "passive": {
    "core": {
      "name": "Eridanus: Riverflow",
      "description": "Passive bonuses apply automatically.\nIn normal state recovers 80 Astrum per second (Max: 600).\nIn Astral Harness state, loses 50 Astrum per second. Reverts to normal state at 0 Astrum or switch-out.\nSpina Astera's Charged ATK in Astral Harness state generates Void Vortex that pulls enemies over a small area. All enemies are affected by Starshine Circle simultaneously. Upon exiting Astral Harness state, Void Vortex and Starshine Circle both cease."
    },
    "subskills": [
      {
        "name": "Blessing of the Holy Blade",
        "description": "Enemies within Starshine Circle take 20.0% bonus Fire DMG from Spina Astera (independent effect)."
      },
      {
        "name": "α Eridanus",
        "description": "In normal state, the landing attack of Basic ATK SEQ 4 restores 50 Astrum on hit."
      },
      {
        "name": "β Eridanus",
        "description": "Fire DMG increases by 80.0%. Spina Astera deals 20.0% bonus Fire DMG to ignited enemies."
      }
    ]
  },
  "ultimate": {
    "core": {
      "name": "Pisces: Alrescha",
      "description": "Wield the might of the simulated Holy Blade to deal massive DMG.\nSpina Astera restores 600 Astrum and enters Astral Harness. She unleashes a massive Void Vortex using the simulated Holy Blade to deal 1500% + 11 x 20% ATK of Fire DMG during which all skill timers and the stage timer are paused. When Ultimate ends, a Void Vortex EX is created in front of Spina Astera.\n SP cost: 100. CD: 20s."
    },
    "subskills": [
      {
        "name": "η Pisces",
        "description": "Entering Astral Harness triggers 2s of global Time Fracture.",
        "requiredRank": "s2"
      },
      {
        "name": "γ Pisces",
        "description": "Void Vortex ignites enemies on hit and make them take 30% ATK of Fire DMG every 0.5s for 8.0s. Triggering it again resets the duration."
      }
    ]
  },
  "evasion": {
    "core": {
      "name": "Andromeda: Nebula",
      "description": "Evade enemy attacks up to twice in a row.\nUltimate Evasion Skill: triggers 3s of global Time Fracture and grants 5 stacks of Blazar if in Astral Harness. Also restores 200 HP if there are ignited enemies within Starshine Circle. CD: 15s.\nTap [ATK] immediately after Ultimate Evasion to connect into Basic ATK SEQ 3."
    },
    "subskills": [
      {
        "name": "α Andromedae",
        "description": "Ultimate Evasion Skill boosts Valkyrie's Total DMG by 15.0% for 3s and restores 5.0 SP.",
        "requiredRank": "ss2"
      },
      {
        "name": "β Andromedae",
        "description": "Entering when Astrum is not full grants Valkyrie 200 Astrum. CD: 10s."
      }
    ]
  },
  "basic": {
    "core": {
      "name": "Canis Major: Sirius",
      "description": "Wields a scythe to attack and ignite enemies with the might of stars.\nNormal State:\nSEQ 1: Deals 80% ATK of Fire DMG and restores 10 Astrum.\nSEQ 2: Deals 40% + 100% ATK of Fire DMG and restores 5 + 10 Astrum.\nSEQ 3: Deals 40% + 100% ATK of Fire DMG and restores 10 + 15 Astrum.\nSEQ 4: Deals 3 x 20% + 100% ATK of Fire DMG and restores 3 x 5 + 20 Astrum.\n\nAstral Harness state:\nSEQ 1: 80% and bonus 1 Astral Flare DMG once.\nSEQ 2: 40% + 100% and bonus 1 Astral Flare DMG once.\nSEQ 3: 40% + 150% and bonus 2 Astral Flare DMG twice.\nSEQ 4: 4 x 20% + 100%\nSEQ 5: 150% + 300%\n\nAstral Flare deals 30% ATK of Fire DMG each time.\n\nIn Astral Harness, Basic ATK grants one stack of Blazar on hit and each stack makes the Astral Flare: Erupt thrust deal 30% ATK of Fire DMG. SEQ 1/2/3/4 of Basic ATK each grants 1 stack, and SEQ 5 grants 5 stacks. 20 stacks max. Casting Ultimate grants full stacks. Casting Astral Flare: Erupt or exiting Astral Harness resets Blazar."
    },
    "subskills": [
      {
        "name": "α Canis Major",
        "description": "Astral Flare: Erupt deals 150.0% ATK of bonus Fire DMG.",
        "requiredRank": "sss"
      },
      {
        "name": "ε Canis Major",
        "description": "In Astral Harness, Basic ATK SEQ 4 ignites enemies on hit and make them take 30% ATK of Fire DMG every 0.5s for 8.0s. Triggering it again resets the duration."
      },
      {
        "name": "QTE: δ Canis Major",
        "description": "QTE: Triggered when an enemy is knocked airborne or ignited to induce 3s of global Time Fracture, deal 5 x 250% ATK Fire DMG, and restore 5.0 SP."
      }
    ]
  }
}
