{
  "id": "sr",
  "version": "2.1",
  "name": "Sakuno Rondo",
  "type": "psychic",
  "valkyrie": "theresa",
  "features": ["fire-dmg", "burst", "fast atk", "ignite"],
  "leader": {
    "core": {
      "name": "Ritual Dance",
      "description": "Leader Bonus:\nRitual Dance: For the team, attacks made against enemies knocked airborne gain 24% Total DMG Multiplier. Teams with 3 characters of different types gain 18% Elemental DMG."
    },
    "subskills": [
      {
        "name": "Ritual Dance",
        "description": "For the team, attacks against enemies knocked airborne gain 24% Total DMG Multiplier. If team is composed of 3 characters of different types, gain 18% Elemental DMG.",
        "requiredRank": "s"
      }
    ]
  },
  "special": {
    "core": {
      "name": "Charged: Scorching Foxfire",
      "description": "Charge during the 5-sequence Basic ATK to unleash Foxfire.\nTap and hold the [ATK] button to charge during a 5-sequence Basic ATK or Ultimate to unleash Foxfire after a short charge, dealing 3x50% ATK of Fire DMG to target and its surrounding enemies.\nFoxfire transforms Sakura Brand into Scorching Sakura Brand that then explodes after 1s, dealing 300% ATK of Fire DMG and knocking enemies airborne."
    },
    "subskills": [
      {
        "name": "Switch: Twin Slashers",
        "description": "Switch: Launches 2 flying blades, each blade deals 3x250.0% ATK of Physical DMG and knocks down the enemy."
      },
      {
        "name": "Detonate Brand",
        "description": "Scorching Sakura Brand explosions deal 621% ATK of Fire DMG. When not in Hijoyo Mode, recover 5.0 SP every time Foxfire scorches a Sakura Brand."
      },
      {
        "name": "QTE: Triplex Slashers",
        "description": "QTE: Triggered when enemy is paralyzed. Enters the battle near the target and unleashes 3-sequence sword ki, each hit dealing 324.0% ATK of Physical DMG and adding a Sakura Count.",
        "requiredRank": "s"
      }
    ]
  },
  "passive": {
    "core": {
      "name": "Passive",
      "description": "Passive bonuses apply automatically.\nSakura Brand: Clears the Sakura Count on enemy once the count has reached 3 and inflicts a Sakura Brand. The Sakura Brand lasts for 10s."
    },
    "subskills": [
      {
        "name": "World's #1 Cutie",
        "description": "Gain 30.0 initial SP in battle. This bonus triggers once every 10 minutes in Open World."
      },
      {
        "name": "Not the Ears",
        "description": "Each hit against frozen / paralyzed enemies deals an additional 80% Fire DMG.",
        "requiredRank": "s"
      },
      {
        "name": "Let's Dance",
        "description": "When cross is deployed, team gains 23.4% Elemental DMG for 7.50s.",
        "requiredRank": "ss"
      }
    ]
  },
  "ultimate": {
    "core": {
      "name": "Hijoyo Frenzy",
      "description": "Unleash Valkyrie burst to enter Hijoyo Mode and gain increased Ignore Interrupt.\nBurst: Upon activation, unleash 3 combo slashes, each dealing 100% ATK of Physical DMG in a large area, inflicting a Sakura Count, igniting the target to deal 30% ATK of Fire DMG every 0.5s for 10s, and stacking 12 Ignite Trauma.\nSakura Soul: The 5-sequence Basic ATK becomes Ultimate ATK, which deals Fire DMG instead and transforms Sakura Brands.\nThe 3rd and 5th sequences each inflicts one Sakura Count.\nAt over 80 SP, consumes 20 SP to activate and 8 SP/s afterwards until SP is depleted or the burst mode is manually ended. Max duration: 60s."
    },
    "subskills": [
      {
        "name": "Fire Sprite",
        "description": "In Hijoyo Mode, character deals 50.0% more Fire DMG."
      },
      {
        "name": "Sakura Mark",
        "description": "3rd and 5th sequences of Ultimates apply 1 Sakura Counts on the target and deal additional 180.0% ATK of Physical DMG.",
        "requiredRank": "s"
      },
      {
        "name": "Warding Sprite",
        "description": "In Hijoyo Mode, gain 52.1% Total DMG Reduction, shorten the duration of most debuffs by 70%, and gain 45.1% Attack Speed.",
        "requiredRank": "sss"
      }
    ]
  },
  "evasion": {
    "core": {
      "name": "Burning Kenbu",
      "description": "Quick side-step to evade enemy attacks.\nUltimate Evasion: Generates a 3-sequence sword aura, each hit dealing 10% ATK of Physical DMG to surrounding enemies. Character gains 40% Move Speed for 3s.\nBurning Kenbu: Each sword ki hit adds 1 Sakura Count to the target. Tap the [ATK] button within a short duration to directly unleash Foxfire. CD: 15s."
    },
    "subskills": [
      {
        "name": "Blazing Kenbu",
        "description": "Enhances the sword aura triggered by Ultimate Evasions, each hit inflicting additional 50.1% ATK of Fire DMG."
      },
      {
        "name": "Florid Kenbu",
        "description": "Ultimate Evasion CD is reduced by 3.40s. Each sword ki hit has a 18.5% chance to bleed enemies, dealing 40% ATK of Physical DMG every 0.5s for 10s and inflicting 3 Bleed Trauma.",
        "requiredRank": "s"
      }
    ]
  },
  "basic": {
    "core": {
      "name": "Fox Blade",
      "description": "Basic ATK: Mid-range 5-sequence attack with ethereal kanatas.\n1st Sequence: 3x40% ATK of Physical DMG.\n2nd Sequence: 3x40% ATK of Physical DMG.\n3rd Sequence: 150% ATK of Physical DMG.\n4th Sequence: 2 katanas dealing 3x40% ATK of Physical DMG each.\n5th Sequence: 180% ATK of Physical DMG.\nThe 3rd and 5th sequences add 1 Sakura Count to the target."
    },
    "subskills": [
      {
        "name": "Ghostfire Burn",
        "description": "Basic ATK/Ultimate have a 20% chance to ignite enemies, dealing 30% ATK of Fire DMG every 0.5s for 10s and inflicting 5 Ignite Trauma. CD: 6s."
      },
      {
        "name": "Ember",
        "description": "Basic & Ultimate ATKs additionally deal 28.0% ATK of Fire DMG. The 3rd and 5th Sequences of Basic and Ultimate ATKs deal additional 3*60% ATK of Fire DMG."
      },
      {
        "name": "Engraved Mark",
        "description": "Extends the duration of Sakura Brand to applied by self to 20.0s. When Combo Hit Count exceeds 30, gain 20.0% Total DMG Multiplier.",
        "requiredRank": "s"
      }
    ]
  }
}
