{
  "id": "sw",
  "version": "5.4",
  "name": "Silverwing:N-EX",
  "type": "biologic",
  "valkyrie": "bronya",
  "features": ["ice-dmg", "fast atk", "time mastery", "gather", "aerial"],
  "leader": {
    "core": {
      "name": "Hyper Proxy",
      "description": "Leader Bonus\nLeader Skill: Ice DMG dealt by team ranged attackers increases 30.0%; Total DMG dealt by team increases 26.0%."
    },
    "subskills": [
      {
        "name": "Acting Squad Leader",
        "description": "Ice DMG dealt by team ranged attackers increases 30.0%; Total DMG dealt by team increases 26.0%.",
        "requiredRank": "s3"
      }
    ]
  },
  "special": {
    "core": {
      "name": "Combo-Raze Effect",
      "description": "Attacks with rapid gun fire.\nAble to use when the next threshold is more than halfway charged, deploying a scatter barrier and firing a hail of bullets to deal 12 x 20% Ice DMG. If the bullets pass through the scatter barrier, Ice DMG increases by 24 x 20%.\nWhen a scatter barrier is present, the last blow of each Basic ATK grants a charge. If the barrier is broken, the charge is lost. With 2 charges, tap the ATK button to follow the last blow of a Basic ATK with a special Combo ATK dealing 500% Ice DMG. Continue tapping ATK after the Combo finishes to follow with the second blow of a Basic aerial ATK or fourth blow of a Basic Ground ATK. If the special Combo passes through the barrier, it deals 600% + 10 x 20% Ice DMG. Special Combo ATK triggers a global Time Fracture for 2.5 seconds.\nScatter barrier's duration doesn't decrease during the special Combo. Special Combo can be used twice while the barrier is present."
    },
    "subskills": [
      {
        "name": "Cobalt Wings",
        "description": "Combo ATKs deal 50.0% more Ice DMG."
      },
      {
        "name": "Plasma Squeeze",
        "description": "Increase Total DMG against PSY-type enemies by 10.0%. Ice DMG dealt by Combo ATKs increased by 40.0% for a 10 seconds after QTE."
      }
    ]
  },
  "passive": {
    "core": {
      "name": "N-EX Protocol",
      "description": "Automatically receive passive skill bonus.\nDeploy a max of 1 scatter barrier on the field. Next threshold is reduced 1 block/s while barrier is deployed. Regains 1 block/s while barrier is not present for a maximum of 10 blocks. Global Time Fracture triggered for 3.5s when barrier is deployed. Next threshold cleared when barrier is destroyed. User's ATKs passing through barrier double. Barrier grants Basic ground ATKs the following enhancements:\nFirst hit: 4 x 100% Ice DMG\nSecond hit: 2 x 100% Ice DMG\nThird hit: 2 x 100% + 7 x 20% Ice DMG\nFourth hit: 6 x 40% Ice DMG\nFifth hit: 2 x 220% Ice DMG and summons a black hole pulling in enemies, dealing 80% Ice DMG.\nBarrier grants Basic aerial ATKs the following enhancements:\nFirst hit: Deals 2 x 80% Ice DMG.\nSecond hit: Deals 4 x 60% + 7 x 20% Ice DMG.\nThird hit: Deals 18 x 30% + 2 x 220% Ice DMG and summons a black hole pulling in enemies, dealing 80% Ice DMG.\nScatter barrier can block monster's movement but not its ATK. When the duration timer finishes or Silverwing: N-EX leaves the field, the barrier is destroyed, increasing team Total QTE DMG by 30% for 8s.\nOnly one bird bomb can be summoned at a time after third hit of a Basic ground ATK and second hit of a Basic aerial ATK. Only one black hole can be summoned at a time after the last hit of a Basic ground ATK and Basic aerial ATK."
    },
    "subskills": [
      {
        "name": "Buddy Syetem",
        "description": "When the scatter barrier's duration time is finished or Silverwing: N-EX has left the field, a global Time Fracture is triggered for 2.5s.",
        "requiredRank": "sss"
      },
      {
        "name": "Rear Echelon Dev",
        "description": "While charging next threshold, Restore 1.0 SP per second while Silverwing: N-EX is exits the field.",
        "requiredRank": "ss"
      }
    ]
  },
  "ultimate": {
    "core": {
      "name": "Razing Chrome",
      "description": "Launches a powerful laser through a regulator for massive AoE DMG.\nWhen tapped:\nIf grounded, get airborne dealing 100% Ice DMG. Tap ATK afterwards to follow with the second blow of a Basic ATK.\nAerial: Return to the ground dealing 100% Ice DMG. Tap ATK afterards to follow with the third blow of a Basic ATK.\nGetting airborne or grounded moves scatter barrier between you and the enemy hit last.\nIf held: Perform Ultimate for 2500% Ice DMG. During Ultimate, user and enemy skill timers and stage timer are paused. Destroys barriers present on field. A scatter barrier is redployed 10s after use.\nCD: 15s, SP cost: 75"
    },
    "subskills": [
      {
        "name": "Vigilant Procession",
        "description": "Total Ice DMG dealt by user increases 20.0% while a scatter barrier is on the field(Independent effect)"
      },
      {
        "name": "Aerial Salvo",
        "description": "Bullets passing through a scatter barrier deal more 30.0% more Total DMG."
      }
    ]
  },
  "evasion": {
    "core": {
      "name": "Stealth Mode",
      "description": "Quickly dodges enemy ATKs, up to twice in a row.\nWhen dodging, the scatter barrier can be moved between the user and last enemy hit. Scatter barrier duration time is paused while moved. CD: 0.5s. If dodging interrupts a Basic ATK, tap ATK to continue Basic ATK. When performing an Ultimate Evasion, use Ultimate Evasion Skill to open fire, dealing 10 x 20% Ice DMG. Bullets deal 20 x 20% Ice DMG passing through a scatter barrier. CD: 15s"
    },
    "subskills": [
      {
        "name": "Production Assist",
        "description": "Other teammates' QTE, triggers Silverwing: N-EX's QTE."
      }
    ]
  },
  "basic": {
    "core": {
      "name": "Multi-Unit Arm 0019",
      "description": "Attacks with ranged weapon\nFirst Ground ATK deals 2 x 100% Ice DMG.\nSecond Ground ATK deals 100% Ice DMG.\nThird Ground ATK deals 100% + 7 x 20% Ice DMG.\nFifth Ground ATK deals 100% Ice DMG.\nFirst aerial ATK deals 100% Ice DMG.\nSecond aerial ATK deals 50% + 50% + 7 x 20% Ice DMG.\nThird aerial ATK deals 9 x 20% + 100% Ice DMG. You can move during this time.\nDuring Basic ATKs and Combo ATKs, resistance to interruptions increases while DMG received decreases 50%."
    },
    "subskills": [
      {
        "name": "Bunny Refit",
        "description": "Total DMG increases 30.0%, Basic ATK Ice DMG increases 80.0%."
      },
      {
        "name": "QTE-Prompt Plot",
        "description": "QTE: Triggered when enemies are Time Slowed or Frozen. Restores 5.0 SP, triggers a global Time Fracture for 2 seconds and deals 6 x 200.0% Ice DMG. After QTE, CD of the next switch is reduced by 4 seconds."
      }
    ]
  }
}
