{
  "id": "ya",
  "name": "Yamabuki Armor",
  "type": "psychic",
  "valkyrie": "bronya",
  "features": ["physical", "heal", "impair", "burst", "time mastery"],
  "leader": {
    "core": {
      "name": "Mental Sync",
      "description": "Leader Bonus:\nMental Sync: When Combo Hit Count exceeds 30, team gains 26% Crit Rate. PSY-type characters gain 29% Crit DMG."
    },
    "subskills": [
      {
        "name": "Mental Sync",
        "description": "When Combo Hit Count exceeds 30, team gains 26% Crit Rate. PSY-type characters gain 29% Crit DMG."
      }
    ]
  },
  "special": {
    "core": {
      "name": "Switch: Shield Charge",
      "description": "Switch skill immediately unleashes a Shield Charge.\nShield Charge: 150% ATK of Physical DMG and knocks enemy into the air."
    },
    "subskills": [
      {
        "name": "Power Charge",
        "description": "Additionally deals 1,125 Physical DMG against enemies hit by Shield Charge."
      },
      {
        "name": "QTE: Honkai Barrier",
        "description": "QTE: Triggered when an enemy is Time-Slowed, ram with Super Shield Charge. dealing 600% of Physical DMG, stunning enemies for 5s, and inflicting 6 Stun Trauma."
      }
    ]
  },
  "passive": {
    "core": {
      "name": "Passive Skill",
      "description": "Passive bonuses apply automatically."
    },
    "subskills": [
      {
        "name": "Mecha Barrier",
        "description": "All team members have a mech shield that absorbs Physical DMG. This shield has 558 HP which is fully restored if not attacked for 6.0s."
      },
      {
        "name": "Reactive Shield",
        "description": "Mecha shield deals 1,620 Lightning DMG to surrounding enemies and knocks them airborne when breached."
      },
      {
        "name": "Reinforced Barrier",
        "description": "Mecha shield receives DEF equal to 100% of Yamabuki's DEF.",
        "requiredRank": "s"
      }
    ]
  },
  "ultimate": {
    "core": {
      "name": "Overdrive Mode",
      "description": "Unlocks the Mecha's energy restrictions to enter Burst mode: Overdrive.\nOverdrive Cost: At over 40 SP, consumes 10 SP to enter Burst mode and 10 SP/s afterwards until SP is depleted during which the Valkyrie gains Iron Body.\nOverdrive Switch: Tap [Ultimate] to switch off Overdrive.\nHeat Reset: Heat meters of laser-type weapons will be reset upon Burst activation."
    },
    "subskills": [
      {
        "name": "Terror Drain",
        "description": "When Overdrive Mode is triggered, heal the whole team by 108 HP for every impaired enemy hit by fist attacks."
      },
      {
        "name": "Terror Freeze",
        "description": "Upon triggering Overdrive Mode, apply Time Lock to impaired enemies for 10.0s. Affected enemies remain impaired during Time Lock."
      },
      {
        "name": "Mending Link",
        "description": "When Overdrive Mode is triggered, heal the whole team by 299 HP for each enemy kill."
      }
    ]
  },
  "evasion": {
    "core": {
      "name": "Dimension Field",
      "description": "Raises the shield to defend against frontal attacks.\nCounterstrike: Release the [Defense] button at the moment of the attack to unleash a counterstrike, dealing 100% ATK of Physical DMG.\nPerfect Defense: Counterstrike triggers a 5s Time Fracture, during which the Valkyrie gains 50% Move Speed and 30% ATK Speed for 3s.Base CD of Perfect Defense: 15s."
    },
    "subskills": [
      {
        "name": "Reflective Shield",
        "description": "Defense against ranged attacks can also trigger Counterstrike to unleash Shield Charge and ignite enemies dealing 30% ATK of Fire DMG every 0.5s for 10s and inflicting 5 Ignite Trauma."
      },
      {
        "name": "Reverse Trajectory",
        "description": "Reflects the thrown objects back to the ranged attacker upon starting defense, dealing 350% of the original damage."
      },
      {
        "name": "Field Propulsion",
        "description": "Recovers 4 SP for the whole team after Counterstrike.",
        "requiredRank": "ss"
      }
    ]
  },
  "basic": {
    "core": {
      "name": "Charge: Particle Cannon",
      "description": "Charged cannon fire that deals greater DMG with higher charge sequence.\nArm Switch: Charging mode changes with type of weapon equipped."
    },
    "subskills": [
      {
        "name": "Mech Phobia",
        "description": "Uncharged attacks impairs the target and other enemies nearby, decreasing their DEF by 30.0% for 10.0s."
      },
      {
        "name": "Energy Overload",
        "description": "Increases charging speed by 50.0% but decreases Crit Rate by 50%.",
        "requiredRank": "s"
      }
    ]
  }
}
